-- MySQL dump 10.13  Distrib 8.0.46, for Win64 (x86_64)
--
-- Host: localhost    Database: wisdom_shop_api
-- ------------------------------------------------------
-- Server version	8.0.46

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `article`
--

DROP TABLE IF EXISTS `article`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `article` (
  `article_id` int unsigned NOT NULL AUTO_INCREMENT,
  `category_id` int NOT NULL DEFAULT '0',
  `title` varchar(200) NOT NULL DEFAULT '',
  `summary` varchar(500) NOT NULL DEFAULT '',
  `image_url` varchar(255) NOT NULL DEFAULT '',
  `content` mediumtext,
  `views` int NOT NULL DEFAULT '0',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`article_id`),
  KEY `idx_category` (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='文章';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article`
--

LOCK TABLES `article` WRITE;
/*!40000 ALTER TABLE `article` DISABLE KEYS */;
INSERT INTO `article` VALUES (1,1,'智慧商城全新升级，购物体验再上新台阶','本次升级优化了下单流程、新增优惠券中心','https://picsum.photos/seed/art智慧商城/300/300','<h3>智慧商城全新升级，购物体验再上新台阶</h3><p>本次升级优化了下单流程、新增优惠券中心，详细内容以平台规则为准。</p>',390,'2026-09-03 16:15:46'),(2,1,'国庆中秋双节大促活动公告','全场满 300 减 50，更有多重好礼等你来','https://picsum.photos/seed/art国庆中秋/300/300','<h3>国庆中秋双节大促活动公告</h3><p>全场满 300 减 50，更有多重好礼等你来，详细内容以平台规则为准。</p>',343,'2026-09-03 16:15:46'),(3,2,'如何查询订单物流信息？','进入「我的-我的订单」，点击对应订单即可查看物流','https://picsum.photos/seed/art如何查询/300/300','<h3>如何查询订单物流信息？</h3><p>进入「我的-我的订单」，点击对应订单即可查看物流，详细内容以平台规则为准。</p>',300,'2026-09-03 16:15:46'),(4,2,'支持哪些支付方式？','目前支持微信支付与余额支付','https://picsum.photos/seed/art支持哪些/300/300','<h3>支持哪些支付方式？</h3><p>目前支持微信支付与余额支付，详细内容以平台规则为准。</p>',952,'2026-09-03 16:15:46'),(5,2,'如何申请退换货？','在订单详情点击「申请售后」，填写原因后提交即可','https://picsum.photos/seed/art如何申请/300/300','<h3>如何申请退换货？</h3><p>在订单详情点击「申请售后」，填写原因后提交即可，详细内容以平台规则为准。</p>',430,'2026-09-03 16:15:46'),(6,3,'新人购物全流程指引','注册登录、挑选商品、加入购物车、结算下单、收货评价','https://picsum.photos/seed/art新人购物/300/300','<h3>新人购物全流程指引</h3><p>注册登录、挑选商品、加入购物车、结算下单、收货评价，详细内容以平台规则为准。</p>',222,'2026-09-03 16:15:46');
/*!40000 ALTER TABLE `article` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `article_category`
--

DROP TABLE IF EXISTS `article_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `article_category` (
  `category_id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '',
  `sort` int NOT NULL DEFAULT '100',
  PRIMARY KEY (`category_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='文章分类';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `article_category`
--

LOCK TABLES `article_category` WRITE;
/*!40000 ALTER TABLE `article_category` DISABLE KEYS */;
INSERT INTO `article_category` VALUES (1,'商城公告',100),(2,'帮助中心',100),(3,'购物指南',100);
/*!40000 ALTER TABLE `article_category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `balance_log`
--

DROP TABLE IF EXISTS `balance_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `balance_log` (
  `log_id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `value` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '正=收入 负=支出',
  `balance_after` decimal(10,2) NOT NULL DEFAULT '0.00',
  `type` tinyint NOT NULL DEFAULT '10' COMMENT '10收入 20支出',
  `remark` varchar(100) NOT NULL DEFAULT '',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`log_id`),
  KEY `idx_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=63 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='余额明细';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `balance_log`
--

LOCK TABLES `balance_log` WRITE;
/*!40000 ALTER TABLE `balance_log` DISABLE KEYS */;
INSERT INTO `balance_log` VALUES (1,1,200.00,200.00,10,'账户充值','2026-08-28 16:15:46'),(2,1,100.00,300.00,10,'退款到账','2026-08-30 16:15:46'),(3,1,-31.50,268.50,20,'订单消费','2026-09-01 16:15:46'),(4,2,50.00,138.00,10,'账户充值 RC20260907122938234642','2026-09-07 12:29:38'),(5,2,50.00,188.00,10,'账户充值 RC20260907122939931609','2026-09-07 12:29:39'),(6,2,50.00,238.00,10,'账户充值 RC20260907123502882455','2026-09-07 12:35:02'),(7,2,50.00,288.00,10,'账户充值 RC20260907123503414721','2026-09-07 12:35:03'),(8,2,50.00,338.00,10,'账户充值 RC20260907123514768981','2026-09-07 12:35:14'),(9,2,50.00,388.00,10,'账户充值 RC20260907124151742168','2026-09-07 12:41:51'),(10,2,50.00,438.00,10,'账户充值 RC20260907124152309284','2026-09-07 12:41:52'),(11,2,50.00,488.00,10,'账户充值 RC20260907124208415521','2026-09-07 12:42:08'),(12,2,50.00,538.00,10,'账户充值 RC20260907124208105326','2026-09-07 12:42:08'),(13,2,50.00,588.00,10,'账户充值 RC20260907124917822920','2026-09-07 12:49:17'),(14,2,50.00,638.00,10,'账户充值 RC20260907124918862645','2026-09-07 12:49:18'),(15,2,50.00,688.00,10,'账户充值 RC20260907124925677547','2026-09-07 12:49:25'),(16,2,50.00,738.00,10,'账户充值 RC20260907124925935758','2026-09-07 12:49:25'),(17,2,50.00,788.00,10,'账户充值 RC20260907125250158531','2026-09-07 12:52:50'),(18,2,50.00,838.00,10,'账户充值 RC20260907125251433476','2026-09-07 12:52:51'),(19,2,50.00,888.00,10,'账户充值 RC20260907125258656166','2026-09-07 12:52:58'),(20,2,50.00,938.00,10,'账户充值 RC20260907125259300018','2026-09-07 12:52:59'),(21,2,50.00,988.00,10,'账户充值 RC20260907125421740834','2026-09-07 12:54:21'),(22,2,50.00,1038.00,10,'账户充值 RC20260907125422884839','2026-09-07 12:54:22'),(23,2,50.00,1088.00,10,'账户充值 RC20260907125631924568','2026-09-07 12:56:31'),(24,2,50.00,1138.00,10,'账户充值 RC20260907125632487834','2026-09-07 12:56:32'),(25,2,50.00,1188.00,10,'账户充值 RC20260907125808579951','2026-09-07 12:58:08'),(26,2,50.00,1238.00,10,'账户充值 RC20260907125810982865','2026-09-07 12:58:10'),(27,2,50.00,1288.00,10,'账户充值 RC20260907130159103252','2026-09-07 13:01:59'),(28,2,50.00,1338.00,10,'账户充值 RC20260907130200876527','2026-09-07 13:02:00'),(29,2,50.00,1388.00,10,'账户充值 RC20260907130208844510','2026-09-07 13:02:08'),(30,2,50.00,1438.00,10,'账户充值 RC20260907130209735515','2026-09-07 13:02:09'),(31,2,50.00,1488.00,10,'账户充值 RC20260907130235154869','2026-09-07 13:02:35'),(32,2,50.00,1538.00,10,'账户充值 RC20260907130236981174','2026-09-07 13:02:36'),(33,2,50.00,1588.00,10,'账户充值 RC20260907130740171482','2026-09-07 13:07:40'),(34,2,50.00,1638.00,10,'账户充值 RC20260907130741212501','2026-09-07 13:07:41'),(35,2,50.00,1688.00,10,'账户充值 RC20260909200057348958','2026-09-09 20:00:57'),(36,2,50.00,1738.00,10,'账户充值 RC20260909200058435601','2026-09-09 20:00:58'),(37,2,50.00,1788.00,10,'账户充值 RC20260909200201728260','2026-09-09 20:02:01'),(38,2,50.00,1838.00,10,'账户充值 RC20260909200203223965','2026-09-09 20:02:03'),(39,2,50.00,1888.00,10,'账户充值 RC20260909200231112251','2026-09-09 20:02:31'),(40,2,50.00,1938.00,10,'账户充值 RC20260909200232184957','2026-09-09 20:02:32'),(41,2,50.00,1988.00,10,'账户充值 RC20260909200510841050','2026-09-09 20:05:10'),(42,2,50.00,2038.00,10,'账户充值 RC20260909200511745582','2026-09-09 20:05:11'),(43,2,50.00,2088.00,10,'账户充值 RC20260909222127311910','2026-09-09 22:21:27'),(44,2,50.00,2138.00,10,'账户充值 RC20260909222129459814','2026-09-09 22:21:29'),(45,2,50.00,2188.00,10,'账户充值 RC20260909223743465392','2026-09-09 22:37:43'),(46,2,50.00,2238.00,10,'账户充值 RC20260909223745712227','2026-09-09 22:37:45'),(47,2,50.00,2288.00,10,'账户充值 RC20260909232212717941','2026-09-09 23:22:12'),(48,2,50.00,2338.00,10,'账户充值 RC20260909232213947308','2026-09-09 23:22:13'),(49,2,50.00,2388.00,10,'账户充值 RC20260909232351333524','2026-09-09 23:23:51'),(50,2,50.00,2438.00,10,'账户充值 RC20260909232352788147','2026-09-09 23:23:52'),(51,2,50.00,2488.00,10,'账户充值 RC20260909232506157614','2026-09-09 23:25:06'),(52,2,50.00,2538.00,10,'账户充值 RC20260909232508269646','2026-09-09 23:25:08'),(53,2,50.00,2588.00,10,'账户充值 RC20260910001935519193','2026-09-10 00:19:35'),(54,2,50.00,2638.00,10,'账户充值 RC20260910001936461474','2026-09-10 00:19:36'),(55,2,50.00,2688.00,10,'账户充值 RC20260910004618334214','2026-09-10 00:46:18'),(56,2,50.00,2738.00,10,'账户充值 RC20260910004619578263','2026-09-10 00:46:19'),(57,2,50.00,2788.00,10,'账户充值 RC20260910191721732164','2026-09-10 19:17:21'),(58,2,50.00,2838.00,10,'账户充值 RC20260910191722803735','2026-09-10 19:17:23'),(59,2,50.00,2888.00,10,'账户充值 RC20260910191732563707','2026-09-10 19:17:32'),(60,2,50.00,2938.00,10,'账户充值 RC20260910191815542983','2026-09-10 19:18:15'),(61,2,50.00,2988.00,10,'账户充值 RC20260910191833537105','2026-09-10 19:18:33'),(62,2,50.00,3038.00,10,'账户充值 RC20260910191904812712','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `balance_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `banner`
--

DROP TABLE IF EXISTS `banner`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `banner` (
  `banner_id` int unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL DEFAULT '',
  `image_url` varchar(255) NOT NULL DEFAULT '',
  `link_type` tinyint NOT NULL DEFAULT '0' COMMENT '0无 1商品 2分类',
  `link_value` varchar(100) NOT NULL DEFAULT '',
  `sort` int NOT NULL DEFAULT '100',
  `status` tinyint NOT NULL DEFAULT '1',
  PRIMARY KEY (`banner_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='轮播图';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `banner`
--

LOCK TABLES `banner` WRITE;
/*!40000 ALTER TABLE `banner` DISABLE KEYS */;
INSERT INTO `banner` VALUES (1,'新品首发 钜惠来袭','https://picsum.photos/seed/banner0/750/750',1,'1',400,1),(2,'家电专场 低至 5 折','https://picsum.photos/seed/banner1/750/750',1,'2',300,1),(3,'生鲜水果 产地直发','https://picsum.photos/seed/banner2/750/750',1,'3',200,1),(4,'会员日 满 300 减 50','https://picsum.photos/seed/banner3/750/750',1,'4',100,1);
/*!40000 ALTER TABLE `banner` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cart` (
  `cart_id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `goods_id` int NOT NULL,
  `sku_id` int NOT NULL,
  `goods_num` int NOT NULL DEFAULT '1' COMMENT '数量',
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`cart_id`),
  UNIQUE KEY `uk_user_sku` (`user_id`,`sku_id`)
) ENGINE=InnoDB AUTO_INCREMENT=78 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='购物车';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart`
--

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
INSERT INTO `cart` VALUES (1,1,1,1,2,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(2,1,8,26,1,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(26,2,8,26,1,'2026-09-10 19:19:04','2026-09-10 19:19:04'),(27,2,8,27,1,'2026-09-10 19:19:04','2026-09-10 19:19:04'),(28,2,8,28,1,'2026-09-10 19:19:04','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `comment_id` int unsigned NOT NULL AUTO_INCREMENT,
  `goods_id` int NOT NULL,
  `order_id` int NOT NULL DEFAULT '0',
  `user_id` int NOT NULL,
  `nickname` varchar(50) NOT NULL DEFAULT '',
  `avatar_url` varchar(255) NOT NULL DEFAULT '',
  `content` varchar(1000) NOT NULL DEFAULT '' COMMENT '评价内容',
  `images` text COMMENT '评价图JSON',
  `scores` tinyint NOT NULL DEFAULT '5' COMMENT '综合星级1-5',
  `describe_score` tinyint NOT NULL DEFAULT '5',
  `service_score` tinyint NOT NULL DEFAULT '5',
  `logistics_score` tinyint NOT NULL DEFAULT '5',
  `reply_content` varchar(500) NOT NULL DEFAULT '' COMMENT '商家回复',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`comment_id`),
  KEY `idx_goods` (`goods_id`)
) ENGINE=InnoDB AUTO_INCREMENT=80 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品评价';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES (1,19,904,1,'测试用户小明','https://picsum.photos/seed/avatar13800000001/100/100','性价比不错，会回购，推荐购买。','[\"https://picsum.photos/seed/cmt90419/300/300\"]',5,5,5,5,'感谢您的支持与认可，欢迎再次光临！','2026-09-03 16:15:46'),(2,20,904,1,'测试用户小明','https://picsum.photos/seed/avatar13800000001/100/100','质量很好，物流很快，非常满意的一次购物！','[\"https://picsum.photos/seed/cmt90420/300/300\"]',5,5,5,5,'感谢您的支持与认可，欢迎再次光临！','2026-09-03 16:15:46');
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `coupon`
--

DROP TABLE IF EXISTS `coupon`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `coupon` (
  `coupon_id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '券名称',
  `type` tinyint NOT NULL DEFAULT '10' COMMENT '10满减 20折扣',
  `reduce_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '满减金额',
  `min_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '满X元可用',
  `discount` decimal(3,2) NOT NULL DEFAULT '1.00' COMMENT '折扣 如0.90',
  `coupon_type` tinyint NOT NULL DEFAULT '10' COMMENT '10手动领取 20赠送',
  `total_num` int NOT NULL DEFAULT '0' COMMENT '发行总量 0不限',
  `receive_num` int NOT NULL DEFAULT '0' COMMENT '已领取',
  `limit_num` int NOT NULL DEFAULT '1' COMMENT '每人限领',
  `valid_type` tinyint NOT NULL DEFAULT '20' COMMENT '10固定区间 20领后N天',
  `valid_start` datetime DEFAULT NULL,
  `valid_end` datetime DEFAULT NULL,
  `valid_days` int NOT NULL DEFAULT '30' COMMENT '领后有效天数',
  `status` tinyint NOT NULL DEFAULT '10' COMMENT '10启用 20停用',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`coupon_id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='优惠券模板';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `coupon`
--

LOCK TABLES `coupon` WRITE;
/*!40000 ALTER TABLE `coupon` DISABLE KEYS */;
INSERT INTO `coupon` VALUES (1,'新人满100减20优惠券',10,20.00,100.00,1.00,10,1000,24,1,20,NULL,NULL,30,10,'2026-09-03 16:15:46'),(2,'满300减50通用券',10,50.00,300.00,1.00,10,1000,20,1,20,NULL,NULL,30,10,'2026-09-03 16:15:46'),(3,'满1000减120大额券',10,120.00,1000.00,1.00,10,1000,0,1,20,NULL,NULL,60,10,'2026-09-03 16:15:46'),(4,'满50减10品类券',10,10.00,50.00,1.00,10,1000,0,3,20,NULL,NULL,15,10,'2026-09-03 16:15:46'),(5,'9折优惠券(最高减30)',20,0.00,0.00,0.90,10,1000,0,1,20,NULL,NULL,30,10,'2026-09-03 16:15:46');
/*!40000 ALTER TABLE `coupon` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `express`
--

DROP TABLE IF EXISTS `express`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `express` (
  `express_id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL DEFAULT '',
  `code` varchar(30) NOT NULL DEFAULT '',
  `logo` varchar(255) NOT NULL DEFAULT '',
  `sort` int NOT NULL DEFAULT '100',
  PRIMARY KEY (`express_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='物流公司';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `express`
--

LOCK TABLES `express` WRITE;
/*!40000 ALTER TABLE `express` DISABLE KEYS */;
INSERT INTO `express` VALUES (1,'顺丰速运','SF','',100),(2,'京东物流','JD','',200),(3,'中通快递','ZTO','',300),(4,'圆通速递','YTO','',400),(5,'韵达快递','YD','',500),(6,'邮政EMS','EMS','',600);
/*!40000 ALTER TABLE `express` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods`
--

DROP TABLE IF EXISTS `goods`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods` (
  `goods_id` int unsigned NOT NULL AUTO_INCREMENT,
  `category_id` int NOT NULL DEFAULT '0' COMMENT '三级分类ID',
  `goods_name` varchar(200) NOT NULL DEFAULT '' COMMENT '商品名',
  `selling_point` varchar(255) NOT NULL DEFAULT '' COMMENT '卖点',
  `goods_image` varchar(255) NOT NULL DEFAULT '' COMMENT '主图',
  `images` text COMMENT '轮播图JSON',
  `price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '起售价',
  `line_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '划线价',
  `stock_total` int NOT NULL DEFAULT '0' COMMENT '总库存',
  `sales_total` int NOT NULL DEFAULT '0' COMMENT '总销量',
  `content` mediumtext COMMENT '商品详情',
  `spec_type` tinyint NOT NULL DEFAULT '10' COMMENT '规格 10单规格 20多规格',
  `status` tinyint NOT NULL DEFAULT '10' COMMENT '10上架 20下架',
  `is_delete` tinyint NOT NULL DEFAULT '0',
  `sort` int NOT NULL DEFAULT '100',
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`goods_id`),
  KEY `idx_category` (`category_id`),
  KEY `idx_status` (`status`)
) ENGINE=InnoDB AUTO_INCREMENT=172 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品SPU';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods`
--

LOCK TABLES `goods` WRITE;
/*!40000 ALTER TABLE `goods` DISABLE KEYS */;
INSERT INTO `goods` VALUES (1,3,'海信 65 英寸 4K 超高清智能平板电视','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g01/400/400','[\"https://picsum.photos/seed/g01/400/400\",\"https://picsum.photos/seed/g02/400/400\",\"https://picsum.photos/seed/g03/400/400\"]',2799.00,3299.00,1025,1961,'<p>海信 65 英寸 4K 超高清智能平板电视</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g04/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(2,3,'海尔对开门双变频风冷无霜冰箱 500L','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g11/400/400','[\"https://picsum.photos/seed/g11/400/400\",\"https://picsum.photos/seed/g12/400/400\",\"https://picsum.photos/seed/g13/400/400\"]',3599.00,4299.00,1219,399,'<p>海尔对开门双变频风冷无霜冰箱 500L</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g14/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(3,3,'小天鹅 10 公斤滚筒洗衣机全自动变频','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g21/400/400','[\"https://picsum.photos/seed/g21/400/400\",\"https://picsum.photos/seed/g22/400/400\",\"https://picsum.photos/seed/g23/400/400\"]',1899.00,2299.00,935,773,'<p>小天鹅 10 公斤滚筒洗衣机全自动变频</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g24/800/800\"/>',10,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(4,3,'格力 1.5 匹新一级能效变频冷暖空调挂机','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g31/400/400','[\"https://picsum.photos/seed/g31/400/400\",\"https://picsum.photos/seed/g32/400/400\",\"https://picsum.photos/seed/g33/400/400\"]',2499.00,2899.00,1532,1423,'<p>格力 1.5 匹新一级能效变频冷暖空调挂机</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g34/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(5,4,'戴森无线手持吸尘器家用大吸力','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g41/400/400','[\"https://picsum.photos/seed/g41/400/400\",\"https://picsum.photos/seed/g42/400/400\",\"https://picsum.photos/seed/g43/400/400\"]',2199.00,2590.00,1179,357,'<p>戴森无线手持吸尘器家用大吸力</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g44/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(6,4,'静音空气加湿器卧室大容量 4.5L','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g51/400/400','[\"https://picsum.photos/seed/g51/400/400\",\"https://picsum.photos/seed/g52/400/400\",\"https://picsum.photos/seed/g53/400/400\"]',129.00,199.00,790,1413,'<p>静音空气加湿器卧室大容量 4.5L</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g54/800/800\"/>',10,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(7,4,'小米落地扇电风扇家用静音遥控','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g61/400/400','[\"https://picsum.photos/seed/g61/400/400\",\"https://picsum.photos/seed/g62/400/400\",\"https://picsum.photos/seed/g63/400/400\"]',249.00,329.00,320,1352,'<p>小米落地扇电风扇家用静音遥控</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g64/800/800\"/>',10,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(8,5,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','','[\"https://picsum.photos/seed/g71/400/400\",\"https://picsum.photos/seed/g72/400/400\",\"https://picsum.photos/seed/g73/400/400\"]',3999.00,0.00,1718,341,'<p>旗舰 5G 智能手机 骁龙8 16GB+512GB</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g74/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-10 19:19:04'),(9,5,'超长待机老人机大字大声直板按键','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g81/400/400','[\"https://picsum.photos/seed/g81/400/400\",\"https://picsum.photos/seed/g82/400/400\",\"https://picsum.photos/seed/g83/400/400\"]',199.00,299.00,495,2037,'<p>超长待机老人机大字大声直板按键</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g84/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(10,6,'轻薄商务笔记本电脑 14 英寸 i7 16G','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g91/400/400','[\"https://picsum.photos/seed/g91/400/400\",\"https://picsum.photos/seed/g92/400/400\",\"https://picsum.photos/seed/g93/400/400\"]',5299.00,5999.00,1203,194,'<p>轻薄商务笔记本电脑 14 英寸 i7 16G</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g94/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(11,6,'11 英寸平板电脑影音娱乐学习上网课','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g101/400/400','[\"https://picsum.photos/seed/g101/400/400\",\"https://picsum.photos/seed/g102/400/400\",\"https://picsum.photos/seed/g103/400/400\"]',1599.00,1899.00,956,753,'<p>11 英寸平板电脑影音娱乐学习上网课</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g104/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(12,6,'机械键盘青轴有线电竞游戏 104 键','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g111/400/400','[\"https://picsum.photos/seed/g111/400/400\",\"https://picsum.photos/seed/g112/400/400\",\"https://picsum.photos/seed/g113/400/400\"]',169.00,239.00,627,621,'<p>机械键盘青轴有线电竞游戏 104 键</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g114/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(13,8,'纯棉短袖 T 恤男夏季宽松圆领打底衫','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g121/400/400','[\"https://picsum.photos/seed/g121/400/400\",\"https://picsum.photos/seed/g122/400/400\",\"https://picsum.photos/seed/g123/400/400\"]',59.00,99.00,2475,771,'<p>纯棉短袖 T 恤男夏季宽松圆领打底衫</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g124/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(14,8,'男士休闲夹克外套春秋百搭上衣','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g131/400/400','[\"https://picsum.photos/seed/g131/400/400\",\"https://picsum.photos/seed/g132/400/400\",\"https://picsum.photos/seed/g133/400/400\"]',199.00,329.00,804,1672,'<p>男士休闲夹克外套春秋百搭上衣</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g134/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(15,8,'男士直筒修身弹力牛仔裤','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g141/400/400','[\"https://picsum.photos/seed/g141/400/400\",\"https://picsum.photos/seed/g142/400/400\",\"https://picsum.photos/seed/g143/400/400\"]',129.00,199.00,2800,1463,'<p>男士直筒修身弹力牛仔裤</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g144/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(16,9,'法式碎花连衣裙女夏季收腰显瘦','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g151/400/400','[\"https://picsum.photos/seed/g151/400/400\",\"https://picsum.photos/seed/g152/400/400\",\"https://picsum.photos/seed/g153/400/400\"]',159.00,259.00,1352,1578,'<p>法式碎花连衣裙女夏季收腰显瘦</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g154/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(17,9,'女士针织衫薄款打底衫春秋新款','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g161/400/400','[\"https://picsum.photos/seed/g161/400/400\",\"https://picsum.photos/seed/g162/400/400\",\"https://picsum.photos/seed/g163/400/400\"]',89.00,149.00,641,497,'<p>女士针织衫薄款打底衫春秋新款</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g164/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(18,10,'每日坚果混合坚果 30 包休闲零食大礼包','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g171/400/400','[\"https://picsum.photos/seed/g171/400/400\",\"https://picsum.photos/seed/g172/400/400\",\"https://picsum.photos/seed/g173/400/400\"]',79.00,129.00,376,1866,'<p>每日坚果混合坚果 30 包休闲零食大礼包</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g174/800/800\"/>',20,10,0,100,'2026-09-03 16:15:45','2026-09-03 16:15:45'),(19,10,'蔓越莓曲奇饼干礼盒装办公室零食','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g181/400/400','[\"https://picsum.photos/seed/g181/400/400\",\"https://picsum.photos/seed/g182/400/400\",\"https://picsum.photos/seed/g183/400/400\"]',39.90,59.00,229,72,'<p>蔓越莓曲奇饼干礼盒装办公室零食</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g184/800/800\"/>',10,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(20,13,'陕西红富士苹果新鲜水果脆甜 5 斤装','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g191/400/400','[\"https://picsum.photos/seed/g191/400/400\",\"https://picsum.photos/seed/g192/400/400\",\"https://picsum.photos/seed/g193/400/400\"]',39.90,59.90,375,1413,'<p>陕西红富士苹果新鲜水果脆甜 5 斤装</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g194/800/800\"/>',20,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(21,14,'进口车厘子智利大樱桃 JJ 级 2 斤','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g201/400/400','[\"https://picsum.photos/seed/g201/400/400\",\"https://picsum.photos/seed/g202/400/400\",\"https://picsum.photos/seed/g203/400/400\"]',119.00,169.00,625,453,'<p>进口车厘子智利大樱桃 JJ 级 2 斤</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g204/800/800\"/>',20,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(22,16,'全棉磨毛四件套 1.8m 床上用品加厚','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g211/400/400','[\"https://picsum.photos/seed/g211/400/400\",\"https://picsum.photos/seed/g212/400/400\",\"https://picsum.photos/seed/g213/400/400\"]',299.00,499.00,1178,1844,'<p>全棉磨毛四件套 1.8m 床上用品加厚</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g214/800/800\"/>',20,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(23,16,'乳胶枕头护颈椎助睡眠单人枕芯','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g221/400/400','[\"https://picsum.photos/seed/g221/400/400\",\"https://picsum.photos/seed/g222/400/400\",\"https://picsum.photos/seed/g223/400/400\"]',79.00,139.00,545,1183,'<p>乳胶枕头护颈椎助睡眠单人枕芯</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g224/800/800\"/>',20,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(24,17,'麦饭石不粘锅炒锅家用燃气灶适用','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g231/400/400','[\"https://picsum.photos/seed/g231/400/400\",\"https://picsum.photos/seed/g232/400/400\",\"https://picsum.photos/seed/g233/400/400\"]',109.00,189.00,646,1527,'<p>麦饭石不粘锅炒锅家用燃气灶适用</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g234/800/800\"/>',20,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(25,17,'不锈钢刀具套装厨房全套菜刀七件套','热销爆款·品质保证·限时特惠','https://picsum.photos/seed/g241/400/400','[\"https://picsum.photos/seed/g241/400/400\",\"https://picsum.photos/seed/g242/400/400\",\"https://picsum.photos/seed/g243/400/400\"]',149.00,229.00,397,1243,'<p>不锈钢刀具套装厨房全套菜刀七件套</p><p>甄选优质原料，严选品质，售后无忧，支持 7 天无理由退换。</p><img src=\"https://picsum.photos/seed/g244/800/800\"/>',10,10,0,100,'2026-09-03 16:15:46','2026-09-03 16:15:46'),(26,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-05 13:23:42','2026-09-05 13:23:42'),(27,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-05 13:31:45','2026-09-05 13:31:45'),(28,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-05 13:35:33','2026-09-05 13:35:33'),(29,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-05 13:37:07','2026-09-05 13:37:07'),(30,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-05 13:39:24','2026-09-05 13:39:24'),(31,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-05 13:43:15','2026-09-05 13:43:15'),(32,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-06 00:16:35','2026-09-06 00:16:35'),(33,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-06 00:18:57','2026-09-06 00:18:57'),(34,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-06 00:19:08','2026-09-06 00:19:08'),(35,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-06 00:20:12','2026-09-06 00:20:12'),(36,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-06 00:21:26','2026-09-06 00:21:26'),(37,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-06 00:24:21','2026-09-06 00:24:21'),(38,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:27:44','2026-09-07 12:27:44'),(39,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:29:38','2026-09-07 12:29:38'),(40,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(41,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(42,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,0,100,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(43,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:35:02','2026-09-07 12:35:02'),(44,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(45,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(46,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,0,100,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(47,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:35:13','2026-09-07 12:35:13'),(48,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:35:14','2026-09-07 12:35:14'),(49,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:35:14','2026-09-07 12:35:14'),(50,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,0,100,'2026-09-07 12:35:14','2026-09-07 12:35:14'),(51,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:35:32','2026-09-07 12:35:32'),(52,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:41:51','2026-09-07 12:41:51'),(53,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:41:52','2026-09-07 12:41:52'),(54,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:41:52','2026-09-07 12:41:52'),(55,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,0,100,'2026-09-07 12:41:52','2026-09-07 12:41:52'),(56,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(57,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(58,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(59,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,0,100,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(60,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:49:17','2026-09-07 12:49:17'),(61,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(62,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(63,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(64,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:49:24','2026-09-07 12:49:24'),(65,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(66,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(67,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(68,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:52:50','2026-09-07 12:52:50'),(69,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(70,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(71,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(72,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:52:58','2026-09-07 12:52:58'),(73,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(74,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(75,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(76,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:54:21','2026-09-07 12:54:21'),(77,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(78,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(79,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(80,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:56:30','2026-09-07 12:56:30'),(81,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(82,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(83,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(84,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 12:58:08','2026-09-07 12:58:08'),(85,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 12:58:09','2026-09-07 12:58:09'),(86,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 12:58:09','2026-09-07 12:58:09'),(87,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 12:58:09','2026-09-07 12:58:09'),(88,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 13:01:59','2026-09-07 13:01:59'),(89,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 13:02:00','2026-09-07 13:02:00'),(90,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 13:02:00','2026-09-07 13:02:00'),(91,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 13:02:00','2026-09-07 13:02:00'),(92,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(93,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(94,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 13:02:09','2026-09-07 13:02:09'),(95,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 13:02:09','2026-09-07 13:02:09'),(96,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(97,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(98,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(99,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 13:02:35','2026-09-07 13:02:36'),(100,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(101,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(102,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(103,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-07 13:07:40','2026-09-07 13:07:41'),(104,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 18:37:07','2026-09-09 18:37:07'),(105,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 19:55:47','2026-09-09 19:55:47'),(106,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 19:59:33','2026-09-09 19:59:33'),(107,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 20:00:57','2026-09-09 20:00:57'),(108,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 20:00:58','2026-09-09 20:00:58'),(109,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 20:00:58','2026-09-09 20:00:58'),(110,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 20:00:58','2026-09-09 20:00:58'),(111,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 20:02:01','2026-09-09 20:02:01'),(112,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 20:02:02','2026-09-09 20:02:02'),(113,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 20:02:02','2026-09-09 20:02:02'),(114,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 20:02:02','2026-09-09 20:02:02'),(115,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 20:02:15','2026-09-09 20:02:15'),(116,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 20:02:31','2026-09-09 20:02:31'),(117,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 20:02:32','2026-09-09 20:02:32'),(118,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 20:02:32','2026-09-09 20:02:32'),(119,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 20:02:32','2026-09-09 20:02:32'),(120,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 20:05:10','2026-09-09 20:05:10'),(121,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(122,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(123,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(124,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 22:21:26','2026-09-09 22:21:26'),(125,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 22:21:28','2026-09-09 22:21:28'),(126,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 22:21:28','2026-09-09 22:21:28'),(127,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 22:21:28','2026-09-09 22:21:28'),(128,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 22:37:42','2026-09-09 22:37:42'),(129,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 22:37:44','2026-09-09 22:37:44'),(130,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 22:37:44','2026-09-09 22:37:44'),(131,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 22:37:44','2026-09-09 22:37:44'),(132,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 23:22:12','2026-09-09 23:22:12'),(133,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 23:22:13','2026-09-09 23:22:13'),(134,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 23:22:13','2026-09-09 23:22:13'),(135,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 23:22:13','2026-09-09 23:22:13'),(136,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 23:23:51','2026-09-09 23:23:51'),(137,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(138,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(139,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(140,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-09 23:25:06','2026-09-09 23:25:06'),(141,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-09 23:25:07','2026-09-09 23:25:07'),(142,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-09 23:25:07','2026-09-09 23:25:07'),(143,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-09 23:25:07','2026-09-09 23:25:07'),(144,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 00:19:34','2026-09-10 00:19:34'),(145,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(146,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(147,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(148,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 00:46:17','2026-09-10 00:46:17'),(149,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(150,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(151,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(152,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 19:17:21','2026-09-10 19:17:21'),(153,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(154,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(155,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(156,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 19:17:32','2026-09-10 19:17:32'),(157,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 19:17:32','2026-09-10 19:17:32'),(158,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 19:17:32','2026-09-10 19:17:32'),(159,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 19:17:32','2026-09-10 19:17:32'),(160,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(161,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(162,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(163,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(164,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 19:18:33','2026-09-10 19:18:33'),(165,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 19:18:33','2026-09-10 19:18:33'),(166,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 19:18:33','2026-09-10 19:18:33'),(167,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 19:18:33','2026-09-10 19:18:33'),(168,3,'5070显卡','50系显卡','','[]',4299.00,4299.00,3,0,'',10,10,0,100,'2026-09-10 19:19:04','2026-09-10 19:19:04'),(169,3,'超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名超长商品名1','','','[]',1.00,1.00,100,0,'',10,10,0,100,'2026-09-10 19:19:04','2026-09-10 19:19:04'),(170,3,'测试商品','','','[]',-1.00,-1.00,100,0,'',10,10,0,100,'2026-09-10 19:19:04','2026-09-10 19:19:04'),(171,3,'自动化测试商品','','','[]',99.90,99.90,10,0,'',10,10,1,100,'2026-09-10 19:19:04','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `goods` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods_category`
--

DROP TABLE IF EXISTS `goods_category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods_category` (
  `category_id` int unsigned NOT NULL AUTO_INCREMENT,
  `parent_id` int NOT NULL DEFAULT '0' COMMENT '上级ID',
  `name` varchar(50) NOT NULL DEFAULT '' COMMENT '分类名',
  `level` tinyint NOT NULL DEFAULT '1' COMMENT '层级 1/2/3',
  `image_url` varchar(255) NOT NULL DEFAULT '' COMMENT '分类图标',
  `sort` int NOT NULL DEFAULT '100' COMMENT '排序',
  `is_show` tinyint NOT NULL DEFAULT '1',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`category_id`),
  KEY `idx_parent` (`parent_id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品分类';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods_category`
--

LOCK TABLES `goods_category` WRITE;
/*!40000 ALTER TABLE `goods_category` DISABLE KEYS */;
INSERT INTO `goods_category` VALUES (1,0,'家用电器',1,'https://picsum.photos/seed/cat家用电器/100/100',100,1,'2026-09-03 16:15:44'),(2,1,'大家电',2,'https://picsum.photos/seed/cat大家电/100/100',100,1,'2026-09-03 16:15:44'),(3,2,'平板电视',3,'https://picsum.photos/seed/cat平板电视/100/100',100,1,'2026-09-03 16:15:45'),(4,2,'冰箱',3,'https://picsum.photos/seed/cat冰箱/100/100',100,1,'2026-09-03 16:15:45'),(5,2,'洗衣机',3,'https://picsum.photos/seed/cat洗衣机/100/100',100,1,'2026-09-03 16:15:45'),(6,2,'空调',3,'https://picsum.photos/seed/cat空调/100/100',100,1,'2026-09-03 16:15:45'),(7,1,'生活电器',2,'https://picsum.photos/seed/cat生活电器/100/100',100,1,'2026-09-03 16:15:45'),(8,7,'吸尘器',3,'https://picsum.photos/seed/cat吸尘器/100/100',100,1,'2026-09-03 16:15:45'),(9,7,'加湿器',3,'https://picsum.photos/seed/cat加湿器/100/100',100,1,'2026-09-03 16:15:45'),(10,7,'电风扇',3,'https://picsum.photos/seed/cat电风扇/100/100',100,1,'2026-09-03 16:15:45'),(11,0,'手机数码',1,'https://picsum.photos/seed/cat手机数码/100/100',100,1,'2026-09-03 16:15:45'),(12,11,'手机通讯',2,'https://picsum.photos/seed/cat手机通讯/100/100',100,1,'2026-09-03 16:15:45'),(13,12,'智能手机',3,'https://picsum.photos/seed/cat智能手机/100/100',100,1,'2026-09-03 16:15:45'),(14,12,'老人机',3,'https://picsum.photos/seed/cat老人机/100/100',100,1,'2026-09-03 16:15:45'),(15,11,'电脑办公',2,'https://picsum.photos/seed/cat电脑办公/100/100',100,1,'2026-09-03 16:15:45'),(16,15,'笔记本电脑',3,'https://picsum.photos/seed/cat笔记本电脑/100/100',100,1,'2026-09-03 16:15:45'),(17,15,'平板电脑',3,'https://picsum.photos/seed/cat平板电脑/100/100',100,1,'2026-09-03 16:15:45'),(18,15,'键盘鼠标',3,'https://picsum.photos/seed/cat键盘鼠标/100/100',100,1,'2026-09-03 16:15:45'),(19,0,'服饰内衣',1,'https://picsum.photos/seed/cat服饰内衣/100/100',100,1,'2026-09-03 16:15:45'),(20,19,'男装',2,'https://picsum.photos/seed/cat男装/100/100',100,1,'2026-09-03 16:15:45'),(21,20,'T恤',3,'https://picsum.photos/seed/catT恤/100/100',100,1,'2026-09-03 16:15:45'),(22,20,'夹克',3,'https://picsum.photos/seed/cat夹克/100/100',100,1,'2026-09-03 16:15:45'),(23,20,'牛仔裤',3,'https://picsum.photos/seed/cat牛仔裤/100/100',100,1,'2026-09-03 16:15:45'),(24,19,'女装',2,'https://picsum.photos/seed/cat女装/100/100',100,1,'2026-09-03 16:15:45'),(25,24,'连衣裙',3,'https://picsum.photos/seed/cat连衣裙/100/100',100,1,'2026-09-03 16:15:45'),(26,24,'针织衫',3,'https://picsum.photos/seed/cat针织衫/100/100',100,1,'2026-09-03 16:15:45'),(27,0,'食品生鲜',1,'https://picsum.photos/seed/cat食品生鲜/100/100',100,1,'2026-09-03 16:15:45'),(28,27,'休闲零食',2,'https://picsum.photos/seed/cat休闲零食/100/100',100,1,'2026-09-03 16:15:45'),(29,28,'坚果炒货',3,'https://picsum.photos/seed/cat坚果炒货/100/100',100,1,'2026-09-03 16:15:45'),(30,28,'饼干蛋糕',3,'https://picsum.photos/seed/cat饼干蛋糕/100/100',100,1,'2026-09-03 16:15:45'),(31,27,'新鲜水果',2,'https://picsum.photos/seed/cat新鲜水果/100/100',100,1,'2026-09-03 16:15:45'),(32,31,'时令水果',3,'https://picsum.photos/seed/cat时令水果/100/100',100,1,'2026-09-03 16:15:45'),(33,31,'进口水果',3,'https://picsum.photos/seed/cat进口水果/100/100',100,1,'2026-09-03 16:15:45'),(34,0,'家居家装',1,'https://picsum.photos/seed/cat家居家装/100/100',100,1,'2026-09-03 16:15:45'),(35,34,'家纺',2,'https://picsum.photos/seed/cat家纺/100/100',100,1,'2026-09-03 16:15:45'),(36,35,'四件套',3,'https://picsum.photos/seed/cat四件套/100/100',100,1,'2026-09-03 16:15:45'),(37,35,'枕头',3,'https://picsum.photos/seed/cat枕头/100/100',100,1,'2026-09-03 16:15:45'),(38,34,'厨具',2,'https://picsum.photos/seed/cat厨具/100/100',100,1,'2026-09-03 16:15:45'),(39,38,'锅具',3,'https://picsum.photos/seed/cat锅具/100/100',100,1,'2026-09-03 16:15:45'),(40,38,'刀具',3,'https://picsum.photos/seed/cat刀具/100/100',100,1,'2026-09-03 16:15:45');
/*!40000 ALTER TABLE `goods_category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods_service`
--

DROP TABLE IF EXISTS `goods_service`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods_service` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `goods_id` int NOT NULL DEFAULT '0' COMMENT '0=通用',
  `name` varchar(30) NOT NULL DEFAULT '' COMMENT '如 7天无理由退货',
  `description` varchar(100) NOT NULL DEFAULT '',
  PRIMARY KEY (`id`),
  KEY `idx_goods` (`goods_id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品服务';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods_service`
--

LOCK TABLES `goods_service` WRITE;
/*!40000 ALTER TABLE `goods_service` DISABLE KEYS */;
INSERT INTO `goods_service` VALUES (1,0,'7天无理由退货','7天无理由退货，购物无忧'),(2,0,'48小时发货','48小时发货，购物无忧'),(3,0,'正品保障','正品保障，购物无忧'),(4,0,'闪电退款','闪电退款，购物无忧'),(5,0,'运费险','运费险，购物无忧');
/*!40000 ALTER TABLE `goods_service` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods_sku`
--

DROP TABLE IF EXISTS `goods_sku`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods_sku` (
  `sku_id` int unsigned NOT NULL AUTO_INCREMENT,
  `goods_id` int NOT NULL,
  `spec_sku_id` varchar(100) NOT NULL DEFAULT '' COMMENT '规格组合标识',
  `spec_text` varchar(100) NOT NULL DEFAULT '' COMMENT '规格文本 红色;XL',
  `goods_sku_no` varchar(50) NOT NULL DEFAULT '' COMMENT 'SKU编码',
  `goods_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '销售价',
  `line_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '划线价',
  `stock_num` int NOT NULL DEFAULT '0' COMMENT '库存',
  `sales_num` int NOT NULL DEFAULT '0' COMMENT '销量',
  `weight` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '重量kg',
  PRIMARY KEY (`sku_id`),
  KEY `idx_goods` (`goods_id`)
) ENGINE=InnoDB AUTO_INCREMENT=256 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品SKU';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods_sku`
--

LOCK TABLES `goods_sku` WRITE;
/*!40000 ALTER TABLE `goods_sku` DISABLE KEYS */;
INSERT INTO `goods_sku` VALUES (1,1,'spec_0','黑色;55英寸','SKU00001-0',2649.00,3178.80,102,79,1.00),(2,1,'spec_1','黑色;65英寸','SKU00001-1',2699.00,3238.80,159,31,1.00),(3,1,'spec_2','黑色;75英寸','SKU00001-2',2749.00,3298.80,170,28,1.00),(4,1,'spec_3','银色;55英寸','SKU00001-3',2799.00,3358.80,248,0,1.00),(5,1,'spec_4','银色;65英寸','SKU00001-4',2849.00,3418.80,204,78,1.00),(6,1,'spec_5','银色;75英寸','SKU00001-5',2899.00,3478.80,142,17,1.00),(7,2,'spec_0','星空灰;460L','SKU00002-0',3449.00,4138.80,99,17,1.00),(8,2,'spec_1','星空灰;500L','SKU00002-1',3499.00,4198.80,121,58,1.00),(9,2,'spec_2','星空灰;560L','SKU00002-2',3549.00,4258.80,219,40,1.00),(10,2,'spec_3','珍珠白;460L','SKU00002-3',3599.00,4318.80,253,63,1.00),(11,2,'spec_4','珍珠白;500L','SKU00002-4',3649.00,4378.80,184,20,1.00),(12,2,'spec_5','珍珠白;560L','SKU00002-5',3699.00,4438.80,343,16,1.00),(13,3,'default','默认','SKU00003',1899.00,2299.00,935,107,1.00),(14,4,'spec_0','1匹;挂机','SKU00004-0',2349.00,2818.80,263,50,1.00),(15,4,'spec_1','1匹;柜机','SKU00004-1',2399.00,2878.80,332,50,1.00),(16,4,'spec_2','1.5匹;挂机','SKU00004-2',2449.00,2938.80,316,62,1.00),(17,4,'spec_3','1.5匹;柜机','SKU00004-3',2499.00,2998.80,140,51,1.00),(18,4,'spec_4','2匹;挂机','SKU00004-4',2549.00,3058.80,139,60,1.00),(19,4,'spec_5','2匹;柜机','SKU00004-5',2599.00,3118.80,342,77,1.00),(20,5,'spec_0','标准版;镍铜色','SKU00005-0',2099.00,2518.80,269,85,1.00),(21,5,'spec_1','标准版;紫黑色','SKU00005-1',2149.00,2578.80,286,88,1.00),(22,5,'spec_2','旗舰版;镍铜色','SKU00005-2',2199.00,2638.80,331,83,1.00),(23,5,'spec_3','旗舰版;紫黑色','SKU00005-3',2249.00,2698.80,293,42,1.00),(24,6,'default','默认','SKU00006',129.00,199.00,790,265,1.00),(25,7,'default','默认','SKU00007',249.00,329.00,320,163,1.00),(26,8,'spec_0','曜石黑;8+256G','SKU00008-0',3799.00,4558.80,45,119,1.00),(27,8,'spec_1','曜石黑;12+512G','SKU00008-1',3849.00,4618.80,180,83,1.00),(28,8,'spec_2','曜石黑;16+1T','SKU00008-2',3899.00,4678.80,97,39,1.00),(29,8,'spec_3','冰川蓝;8+256G','SKU00008-3',3949.00,4738.80,279,53,1.00),(30,8,'spec_4','冰川蓝;12+512G','SKU00008-4',3999.00,4798.80,71,85,1.00),(31,8,'spec_5','冰川蓝;16+1T','SKU00008-5',4049.00,4858.80,338,96,1.00),(32,8,'spec_6','月光白;8+256G','SKU00008-6',4099.00,4918.80,211,66,1.00),(33,8,'spec_7','月光白;12+512G','SKU00008-7',4149.00,4978.80,301,20,1.00),(34,8,'spec_8','月光白;16+1T','SKU00008-8',4199.00,5038.80,196,61,1.00),(35,9,'spec_0','红色','SKU00009-0',149.00,178.80,247,2,1.00),(36,9,'spec_1','黑色','SKU00009-1',199.00,238.80,248,36,1.00),(37,10,'spec_0','i5/16G/512G;深空灰','SKU00010-0',5199.00,6238.80,297,58,1.00),(38,10,'spec_1','i5/16G/512G;银色','SKU00010-1',5249.00,6298.80,311,40,1.00),(39,10,'spec_2','i7/16G/1T;深空灰','SKU00010-2',5299.00,6358.80,330,95,1.00),(40,10,'spec_3','i7/16G/1T;银色','SKU00010-3',5349.00,6418.80,265,70,1.00),(41,11,'spec_0','深空灰;128G','SKU00011-0',1499.00,1798.80,141,56,1.00),(42,11,'spec_1','深空灰;256G','SKU00011-1',1549.00,1858.80,325,50,1.00),(43,11,'spec_2','星光色;128G','SKU00011-2',1599.00,1918.80,143,10,1.00),(44,11,'spec_3','星光色;256G','SKU00011-3',1649.00,1978.80,347,77,1.00),(45,12,'spec_0','青轴','SKU00012-0',119.00,142.80,95,29,1.00),(46,12,'spec_1','红轴','SKU00012-1',169.00,202.80,189,17,1.00),(47,12,'spec_2','茶轴','SKU00012-2',219.00,262.80,343,61,1.00),(48,13,'spec_0','白色;M','SKU00013-0',1.00,1.20,309,98,1.00),(49,13,'spec_1','白色;L','SKU00013-1',1.00,1.20,84,26,1.00),(50,13,'spec_2','白色;XL','SKU00013-2',1.00,1.20,138,78,1.00),(51,13,'spec_3','白色;XXL','SKU00013-3',1.00,1.20,261,86,1.00),(52,13,'spec_4','黑色;M','SKU00013-4',1.00,1.20,314,62,1.00),(53,13,'spec_5','黑色;L','SKU00013-5',9.00,10.80,87,90,1.00),(54,13,'spec_6','黑色;XL','SKU00013-6',59.00,70.80,236,17,1.00),(55,13,'spec_7','黑色;XXL','SKU00013-7',109.00,130.80,131,86,1.00),(56,13,'spec_8','雾霾蓝;M','SKU00013-8',159.00,190.80,256,57,1.00),(57,13,'spec_9','雾霾蓝;L','SKU00013-9',209.00,250.80,223,59,1.00),(58,13,'spec_10','雾霾蓝;XL','SKU00013-10',259.00,310.80,255,11,1.00),(59,13,'spec_11','雾霾蓝;XXL','SKU00013-11',309.00,370.80,181,94,1.00),(60,14,'spec_0','卡其;L','SKU00014-0',49.00,58.80,158,91,1.00),(61,14,'spec_1','卡其;XL','SKU00014-1',99.00,118.80,119,32,1.00),(62,14,'spec_2','卡其;XXL','SKU00014-2',149.00,178.80,126,94,1.00),(63,14,'spec_3','黑色;L','SKU00014-3',199.00,238.80,183,49,1.00),(64,14,'spec_4','黑色;XL','SKU00014-4',249.00,298.80,134,93,1.00),(65,14,'spec_5','黑色;XXL','SKU00014-5',299.00,358.80,84,27,1.00),(66,15,'spec_0','深蓝;29','SKU00015-0',1.00,1.20,109,0,1.00),(67,15,'spec_1','深蓝;30','SKU00015-1',1.00,1.20,120,15,1.00),(68,15,'spec_2','深蓝;31','SKU00015-2',1.00,1.20,342,89,1.00),(69,15,'spec_3','深蓝;32','SKU00015-3',1.00,1.20,52,86,1.00),(70,15,'spec_4','深蓝;33','SKU00015-4',1.00,1.20,173,88,1.00),(71,15,'spec_5','浅蓝;29','SKU00015-5',29.00,34.80,268,91,1.00),(72,15,'spec_6','浅蓝;30','SKU00015-6',79.00,94.80,313,22,1.00),(73,15,'spec_7','浅蓝;31','SKU00015-7',129.00,154.80,156,78,1.00),(74,15,'spec_8','浅蓝;32','SKU00015-8',179.00,214.80,327,70,1.00),(75,15,'spec_9','浅蓝;33','SKU00015-9',229.00,274.80,91,8,1.00),(76,15,'spec_10','黑色;29','SKU00015-10',279.00,334.80,234,21,1.00),(77,15,'spec_11','黑色;30','SKU00015-11',329.00,394.80,308,70,1.00),(78,15,'spec_12','黑色;31','SKU00015-12',379.00,454.80,97,42,1.00),(79,15,'spec_13','黑色;32','SKU00015-13',429.00,514.80,68,63,1.00),(80,15,'spec_14','黑色;33','SKU00015-14',479.00,574.80,142,95,1.00),(81,16,'spec_0','碎花红;S','SKU00016-0',9.00,10.80,312,93,1.00),(82,16,'spec_1','碎花红;M','SKU00016-1',59.00,70.80,138,16,1.00),(83,16,'spec_2','碎花红;L','SKU00016-2',109.00,130.80,347,33,1.00),(84,16,'spec_3','碎花蓝;S','SKU00016-3',159.00,190.80,183,76,1.00),(85,16,'spec_4','碎花蓝;M','SKU00016-4',209.00,250.80,275,47,1.00),(86,16,'spec_5','碎花蓝;L','SKU00016-5',259.00,310.80,97,4,1.00),(87,17,'spec_0','米白;均码','SKU00017-0',39.00,46.80,131,44,1.00),(88,17,'spec_1','粉色;均码','SKU00017-1',89.00,106.80,223,80,1.00),(89,17,'spec_2','黑色;均码','SKU00017-2',139.00,166.80,287,88,1.00),(90,18,'spec_0','7包体验装','SKU00018-0',29.00,34.80,258,8,1.00),(91,18,'spec_1','30包家庭装','SKU00018-1',79.00,94.80,118,4,1.00),(92,19,'default','默认','SKU00019',39.90,59.00,229,294,1.00),(93,20,'spec_0','5斤装','SKU00020-0',1.00,1.20,166,58,1.00),(94,20,'spec_1','10斤装','SKU00020-1',39.90,47.88,209,57,1.00),(95,21,'spec_0','1斤装','SKU00021-0',69.00,82.80,255,30,1.00),(96,21,'spec_1','2斤装','SKU00021-1',119.00,142.80,168,12,1.00),(97,21,'spec_2','5斤礼盒','SKU00021-2',169.00,202.80,202,60,1.00),(98,22,'spec_0','1.5m床;星空灰','SKU00022-0',149.00,178.80,116,25,1.00),(99,22,'spec_1','1.5m床;奶茶杏','SKU00022-1',199.00,238.80,136,91,1.00),(100,22,'spec_2','1.8m床;星空灰','SKU00022-2',249.00,298.80,218,39,1.00),(101,22,'spec_3','1.8m床;奶茶杏','SKU00022-3',299.00,358.80,164,66,1.00),(102,22,'spec_4','2.0m床;星空灰','SKU00022-4',349.00,418.80,299,75,1.00),(103,22,'spec_5','2.0m床;奶茶杏','SKU00022-5',399.00,478.80,245,2,1.00),(104,23,'spec_0','低枕','SKU00023-0',29.00,34.80,229,71,1.00),(105,23,'spec_1','高枕','SKU00023-1',79.00,94.80,316,29,1.00),(106,24,'spec_0','28cm','SKU00024-0',59.00,70.80,289,65,1.00),(107,24,'spec_1','30cm','SKU00024-1',109.00,130.80,261,79,1.00),(108,24,'spec_2','32cm','SKU00024-2',159.00,190.80,96,60,1.00),(109,25,'default','默认','SKU00025',149.00,229.00,397,18,1.00),(110,26,'default','默认','SKU00026',4299.00,4299.00,3,0,1.00),(111,27,'default','默认','SKU00027',4299.00,4299.00,3,0,1.00),(112,28,'default','默认','SKU00028',4299.00,4299.00,3,0,1.00),(113,29,'default','默认','SKU00029',4299.00,4299.00,3,0,1.00),(114,30,'default','默认','SKU00030',4299.00,4299.00,3,0,1.00),(115,31,'default','默认','SKU00031',4299.00,4299.00,3,0,1.00),(116,32,'default','默认','SKU00032',4299.00,4299.00,3,0,1.00),(117,33,'default','默认','SKU00033',4299.00,4299.00,3,0,1.00),(118,34,'default','默认','SKU00034',4299.00,4299.00,3,0,1.00),(119,35,'default','默认','SKU00035',4299.00,4299.00,3,0,1.00),(120,36,'default','默认','SKU00036',4299.00,4299.00,3,0,1.00),(121,37,'default','默认','SKU00037',4299.00,4299.00,3,0,1.00),(122,38,'default','默认','SKU00038',4299.00,4299.00,3,0,1.00),(123,39,'default','默认','SKU00039',4299.00,4299.00,3,0,1.00),(124,40,'default','默认','SKU00040',-1.00,-1.00,100,0,1.00),(125,41,'default','默认','SKU00041',1.00,1.00,100,0,1.00),(126,42,'default','默认','SKU00042',99.90,99.90,10,0,1.00),(127,43,'default','默认','SKU00043',4299.00,4299.00,3,0,1.00),(128,44,'default','默认','SKU00044',-1.00,-1.00,100,0,1.00),(129,45,'default','默认','SKU00045',1.00,1.00,100,0,1.00),(130,46,'default','默认','SKU00046',99.90,99.90,10,0,1.00),(131,47,'default','默认','SKU00047',4299.00,4299.00,3,0,1.00),(132,48,'default','默认','SKU00048',-1.00,-1.00,100,0,1.00),(133,49,'default','默认','SKU00049',1.00,1.00,100,0,1.00),(134,50,'default','默认','SKU00050',99.90,99.90,10,0,1.00),(135,51,'default','默认','SKU00051',4299.00,4299.00,3,0,1.00),(136,52,'default','默认','SKU00052',4299.00,4299.00,3,0,1.00),(137,53,'default','默认','SKU00053',-1.00,-1.00,100,0,1.00),(138,54,'default','默认','SKU00054',1.00,1.00,100,0,1.00),(139,55,'default','默认','SKU00055',99.90,99.90,10,0,1.00),(140,56,'default','默认','SKU00056',4299.00,4299.00,3,0,1.00),(141,57,'default','默认','SKU00057',-1.00,-1.00,100,0,1.00),(142,58,'default','默认','SKU00058',1.00,1.00,100,0,1.00),(143,59,'default','默认','SKU00059',99.90,99.90,10,0,1.00),(144,60,'default','默认','SKU00060',4299.00,4299.00,3,0,1.00),(145,61,'default','默认','SKU00061',-1.00,-1.00,100,0,1.00),(146,62,'default','默认','SKU00062',1.00,1.00,100,0,1.00),(147,63,'default','默认','SKU00063',99.90,99.90,10,0,1.00),(148,64,'default','默认','SKU00064',4299.00,4299.00,3,0,1.00),(149,65,'default','默认','SKU00065',-1.00,-1.00,100,0,1.00),(150,66,'default','默认','SKU00066',1.00,1.00,100,0,1.00),(151,67,'default','默认','SKU00067',99.90,99.90,10,0,1.00),(152,68,'default','默认','SKU00068',4299.00,4299.00,3,0,1.00),(153,69,'default','默认','SKU00069',-1.00,-1.00,100,0,1.00),(154,70,'default','默认','SKU00070',1.00,1.00,100,0,1.00),(155,71,'default','默认','SKU00071',99.90,99.90,10,0,1.00),(156,72,'default','默认','SKU00072',4299.00,4299.00,3,0,1.00),(157,73,'default','默认','SKU00073',-1.00,-1.00,100,0,1.00),(158,74,'default','默认','SKU00074',1.00,1.00,100,0,1.00),(159,75,'default','默认','SKU00075',99.90,99.90,10,0,1.00),(160,76,'default','默认','SKU00076',4299.00,4299.00,3,0,1.00),(161,77,'default','默认','SKU00077',-1.00,-1.00,100,0,1.00),(162,78,'default','默认','SKU00078',1.00,1.00,100,0,1.00),(163,79,'default','默认','SKU00079',99.90,99.90,10,0,1.00),(164,80,'default','默认','SKU00080',4299.00,4299.00,3,0,1.00),(165,81,'default','默认','SKU00081',-1.00,-1.00,100,0,1.00),(166,82,'default','默认','SKU00082',1.00,1.00,100,0,1.00),(167,83,'default','默认','SKU00083',99.90,99.90,10,0,1.00),(168,84,'default','默认','SKU00084',4299.00,4299.00,3,0,1.00),(169,85,'default','默认','SKU00085',-1.00,-1.00,100,0,1.00),(170,86,'default','默认','SKU00086',1.00,1.00,100,0,1.00),(171,87,'default','默认','SKU00087',99.90,99.90,10,0,1.00),(172,88,'default','默认','SKU00088',4299.00,4299.00,3,0,1.00),(173,89,'default','默认','SKU00089',-1.00,-1.00,100,0,1.00),(174,90,'default','默认','SKU00090',1.00,1.00,100,0,1.00),(175,91,'default','默认','SKU00091',99.90,99.90,10,0,1.00),(176,92,'default','默认','SKU00092',4299.00,4299.00,3,0,1.00),(177,93,'default','默认','SKU00093',-1.00,-1.00,100,0,1.00),(178,94,'default','默认','SKU00094',1.00,1.00,100,0,1.00),(179,95,'default','默认','SKU00095',99.90,99.90,10,0,1.00),(180,96,'default','默认','SKU00096',4299.00,4299.00,3,0,1.00),(181,97,'default','默认','SKU00097',-1.00,-1.00,100,0,1.00),(182,98,'default','默认','SKU00098',1.00,1.00,100,0,1.00),(183,99,'default','默认','SKU00099',99.90,99.90,10,0,1.00),(184,100,'default','默认','SKU00100',4299.00,4299.00,3,0,1.00),(185,101,'default','默认','SKU00101',-1.00,-1.00,100,0,1.00),(186,102,'default','默认','SKU00102',1.00,1.00,100,0,1.00),(187,103,'default','默认','SKU00103',99.90,99.90,10,0,1.00),(188,104,'default','默认','SKU00104',4299.00,4299.00,3,0,1.00),(189,105,'default','默认','SKU00105',4299.00,4299.00,3,0,1.00),(190,106,'default','默认','SKU00106',4299.00,4299.00,3,0,1.00),(191,107,'default','默认','SKU00107',4299.00,4299.00,3,0,1.00),(192,108,'default','默认','SKU00108',-1.00,-1.00,100,0,1.00),(193,109,'default','默认','SKU00109',1.00,1.00,100,0,1.00),(194,110,'default','默认','SKU00110',99.90,99.90,10,0,1.00),(195,111,'default','默认','SKU00111',4299.00,4299.00,3,0,1.00),(196,112,'default','默认','SKU00112',-1.00,-1.00,100,0,1.00),(197,113,'default','默认','SKU00113',1.00,1.00,100,0,1.00),(198,114,'default','默认','SKU00114',99.90,99.90,10,0,1.00),(199,115,'default','默认','SKU00115',4299.00,4299.00,3,0,1.00),(200,116,'default','默认','SKU00116',4299.00,4299.00,3,0,1.00),(201,117,'default','默认','SKU00117',-1.00,-1.00,100,0,1.00),(202,118,'default','默认','SKU00118',1.00,1.00,100,0,1.00),(203,119,'default','默认','SKU00119',99.90,99.90,10,0,1.00),(204,120,'default','默认','SKU00120',4299.00,4299.00,3,0,1.00),(205,121,'default','默认','SKU00121',-1.00,-1.00,100,0,1.00),(206,122,'default','默认','SKU00122',1.00,1.00,100,0,1.00),(207,123,'default','默认','SKU00123',99.90,99.90,10,0,1.00),(208,124,'default','默认','SKU00124',4299.00,4299.00,3,0,1.00),(209,125,'default','默认','SKU00125',-1.00,-1.00,100,0,1.00),(210,126,'default','默认','SKU00126',1.00,1.00,100,0,1.00),(211,127,'default','默认','SKU00127',99.90,99.90,10,0,1.00),(212,128,'default','默认','SKU00128',4299.00,4299.00,3,0,1.00),(213,129,'default','默认','SKU00129',-1.00,-1.00,100,0,1.00),(214,130,'default','默认','SKU00130',1.00,1.00,100,0,1.00),(215,131,'default','默认','SKU00131',99.90,99.90,10,0,1.00),(216,132,'default','默认','SKU00132',4299.00,4299.00,3,0,1.00),(217,133,'default','默认','SKU00133',-1.00,-1.00,100,0,1.00),(218,134,'default','默认','SKU00134',1.00,1.00,100,0,1.00),(219,135,'default','默认','SKU00135',99.90,99.90,10,0,1.00),(220,136,'default','默认','SKU00136',4299.00,4299.00,3,0,1.00),(221,137,'default','默认','SKU00137',-1.00,-1.00,100,0,1.00),(222,138,'default','默认','SKU00138',1.00,1.00,100,0,1.00),(223,139,'default','默认','SKU00139',99.90,99.90,10,0,1.00),(224,140,'default','默认','SKU00140',4299.00,4299.00,3,0,1.00),(225,141,'default','默认','SKU00141',-1.00,-1.00,100,0,1.00),(226,142,'default','默认','SKU00142',1.00,1.00,100,0,1.00),(227,143,'default','默认','SKU00143',99.90,99.90,10,0,1.00),(228,144,'default','默认','SKU00144',4299.00,4299.00,3,0,1.00),(229,145,'default','默认','SKU00145',-1.00,-1.00,100,0,1.00),(230,146,'default','默认','SKU00146',1.00,1.00,100,0,1.00),(231,147,'default','默认','SKU00147',99.90,99.90,10,0,1.00),(232,148,'default','默认','SKU00148',4299.00,4299.00,3,0,1.00),(233,149,'default','默认','SKU00149',-1.00,-1.00,100,0,1.00),(234,150,'default','默认','SKU00150',1.00,1.00,100,0,1.00),(235,151,'default','默认','SKU00151',99.90,99.90,10,0,1.00),(236,152,'default','默认','SKU00152',4299.00,4299.00,3,0,1.00),(237,153,'default','默认','SKU00153',-1.00,-1.00,100,0,1.00),(238,154,'default','默认','SKU00154',1.00,1.00,100,0,1.00),(239,155,'default','默认','SKU00155',99.90,99.90,10,0,1.00),(240,156,'default','默认','SKU00156',4299.00,4299.00,3,0,1.00),(241,157,'default','默认','SKU00157',1.00,1.00,100,0,1.00),(242,158,'default','默认','SKU00158',-1.00,-1.00,100,0,1.00),(243,159,'default','默认','SKU00159',99.90,99.90,10,0,1.00),(244,160,'default','默认','SKU00160',4299.00,4299.00,3,0,1.00),(245,161,'default','默认','SKU00161',-1.00,-1.00,100,0,1.00),(246,162,'default','默认','SKU00162',1.00,1.00,100,0,1.00),(247,163,'default','默认','SKU00163',99.90,99.90,10,0,1.00),(248,164,'default','默认','SKU00164',4299.00,4299.00,3,0,1.00),(249,165,'default','默认','SKU00165',1.00,1.00,100,0,1.00),(250,166,'default','默认','SKU00166',-1.00,-1.00,100,0,1.00),(251,167,'default','默认','SKU00167',99.90,99.90,10,0,1.00),(252,168,'default','默认','SKU00168',4299.00,4299.00,3,0,1.00),(253,169,'default','默认','SKU00169',1.00,1.00,100,0,1.00),(254,170,'default','默认','SKU00170',-1.00,-1.00,100,0,1.00),(255,171,'default','默认','SKU00171',99.90,99.90,10,0,1.00);
/*!40000 ALTER TABLE `goods_sku` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `goods_spec`
--

DROP TABLE IF EXISTS `goods_spec`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `goods_spec` (
  `spec_id` int unsigned NOT NULL AUTO_INCREMENT,
  `goods_id` int NOT NULL,
  `spec_name` varchar(30) NOT NULL DEFAULT '' COMMENT '规格名 如颜色',
  `spec_values` text COMMENT '规格值JSON 如[{"value":"红"}]',
  `sort` int NOT NULL DEFAULT '100',
  PRIMARY KEY (`spec_id`),
  KEY `idx_goods` (`goods_id`)
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商品规格';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `goods_spec`
--

LOCK TABLES `goods_spec` WRITE;
/*!40000 ALTER TABLE `goods_spec` DISABLE KEYS */;
INSERT INTO `goods_spec` VALUES (1,1,'颜色','[{\"value\":\"黑色\"},{\"value\":\"银色\"}]',100),(2,1,'尺寸','[{\"value\":\"55英寸\"},{\"value\":\"65英寸\"},{\"value\":\"75英寸\"}]',200),(3,2,'颜色','[{\"value\":\"星空灰\"},{\"value\":\"珍珠白\"}]',100),(4,2,'容量','[{\"value\":\"460L\"},{\"value\":\"500L\"},{\"value\":\"560L\"}]',200),(5,4,'匹数','[{\"value\":\"1匹\"},{\"value\":\"1.5匹\"},{\"value\":\"2匹\"}]',100),(6,4,'类型','[{\"value\":\"挂机\"},{\"value\":\"柜机\"}]',200),(7,5,'版本','[{\"value\":\"标准版\"},{\"value\":\"旗舰版\"}]',100),(8,5,'颜色','[{\"value\":\"镍铜色\"},{\"value\":\"紫黑色\"}]',200),(9,8,'颜色','[{\"value\":\"曜石黑\"},{\"value\":\"冰川蓝\"},{\"value\":\"月光白\"}]',100),(10,8,'内存','[{\"value\":\"8+256G\"},{\"value\":\"12+512G\"},{\"value\":\"16+1T\"}]',200),(11,9,'颜色','[{\"value\":\"红色\"},{\"value\":\"黑色\"}]',100),(12,10,'配置','[{\"value\":\"i5/16G/512G\"},{\"value\":\"i7/16G/1T\"}]',100),(13,10,'颜色','[{\"value\":\"深空灰\"},{\"value\":\"银色\"}]',200),(14,11,'颜色','[{\"value\":\"深空灰\"},{\"value\":\"星光色\"}]',100),(15,11,'容量','[{\"value\":\"128G\"},{\"value\":\"256G\"}]',200),(16,12,'轴体','[{\"value\":\"青轴\"},{\"value\":\"红轴\"},{\"value\":\"茶轴\"}]',100),(17,13,'颜色','[{\"value\":\"白色\"},{\"value\":\"黑色\"},{\"value\":\"雾霾蓝\"}]',100),(18,13,'尺码','[{\"value\":\"M\"},{\"value\":\"L\"},{\"value\":\"XL\"},{\"value\":\"XXL\"}]',200),(19,14,'颜色','[{\"value\":\"卡其\"},{\"value\":\"黑色\"}]',100),(20,14,'尺码','[{\"value\":\"L\"},{\"value\":\"XL\"},{\"value\":\"XXL\"}]',200),(21,15,'颜色','[{\"value\":\"深蓝\"},{\"value\":\"浅蓝\"},{\"value\":\"黑色\"}]',100),(22,15,'尺码','[{\"value\":\"29\"},{\"value\":\"30\"},{\"value\":\"31\"},{\"value\":\"32\"},{\"value\":\"33\"}]',200),(23,16,'颜色','[{\"value\":\"碎花红\"},{\"value\":\"碎花蓝\"}]',100),(24,16,'尺码','[{\"value\":\"S\"},{\"value\":\"M\"},{\"value\":\"L\"}]',200),(25,17,'颜色','[{\"value\":\"米白\"},{\"value\":\"粉色\"},{\"value\":\"黑色\"}]',100),(26,17,'尺码','[{\"value\":\"均码\"}]',200),(27,18,'规格','[{\"value\":\"7包体验装\"},{\"value\":\"30包家庭装\"}]',100),(28,20,'规格','[{\"value\":\"5斤装\"},{\"value\":\"10斤装\"}]',100),(29,21,'规格','[{\"value\":\"1斤装\"},{\"value\":\"2斤装\"},{\"value\":\"5斤礼盒\"}]',100),(30,22,'尺寸','[{\"value\":\"1.5m床\"},{\"value\":\"1.8m床\"},{\"value\":\"2.0m床\"}]',100),(31,22,'花色','[{\"value\":\"星空灰\"},{\"value\":\"奶茶杏\"}]',200),(32,23,'高度','[{\"value\":\"低枕\"},{\"value\":\"高枕\"}]',100),(33,24,'尺寸','[{\"value\":\"28cm\"},{\"value\":\"30cm\"},{\"value\":\"32cm\"}]',100);
/*!40000 ALTER TABLE `goods_spec` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_goods`
--

DROP TABLE IF EXISTS `order_goods`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_goods` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `order_id` int NOT NULL,
  `goods_id` int NOT NULL,
  `sku_id` int NOT NULL,
  `goods_name` varchar(200) NOT NULL DEFAULT '',
  `goods_image` varchar(255) NOT NULL DEFAULT '',
  `spec_text` varchar(100) NOT NULL DEFAULT '',
  `goods_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `goods_num` int NOT NULL DEFAULT '1',
  `total_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `is_commented` tinyint NOT NULL DEFAULT '0' COMMENT '是否已评价',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_order` (`order_id`),
  KEY `idx_goods` (`goods_id`)
) ENGINE=InnoDB AUTO_INCREMENT=108 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='订单商品';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_goods`
--

LOCK TABLES `order_goods` WRITE;
/*!40000 ALTER TABLE `order_goods` DISABLE KEYS */;
INSERT INTO `order_goods` VALUES (1,901,13,48,'纯棉短袖 T 恤男夏季宽松圆领打底衫','https://picsum.photos/seed/g121/400/400','白色;M',1.00,2,2.00,0,'2026-09-03 16:15:46'),(2,901,14,60,'男士休闲夹克外套春秋百搭上衣','https://picsum.photos/seed/g131/400/400','卡其;L',49.00,1,49.00,0,'2026-09-03 16:15:46'),(3,902,1,1,'海信 65 英寸 4K 超高清智能平板电视','https://picsum.photos/seed/g01/400/400','黑色;55英寸',2649.00,2,5298.00,0,'2026-09-03 16:15:46'),(4,903,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','https://picsum.photos/seed/g71/400/400','曜石黑;8+256G',3799.00,2,7598.00,0,'2026-09-03 16:15:46'),(5,903,11,41,'11 英寸平板电脑影音娱乐学习上网课','https://picsum.photos/seed/g101/400/400','深空灰;128G',1499.00,2,2998.00,0,'2026-09-03 16:15:46'),(6,904,19,92,'蔓越莓曲奇饼干礼盒装办公室零食','https://picsum.photos/seed/g181/400/400','默认',39.90,1,39.90,1,'2026-09-03 16:15:46'),(7,904,20,93,'陕西红富士苹果新鲜水果脆甜 5 斤装','https://picsum.photos/seed/g191/400/400','5斤装',1.00,1,1.00,1,'2026-09-03 16:15:46'),(8,905,4,14,'格力 1.5 匹新一级能效变频冷暖空调挂机','https://picsum.photos/seed/g31/400/400','1匹;挂机',2349.00,1,2349.00,1,'2026-09-03 16:15:46'),(9,906,12,45,'机械键盘青轴有线电竞游戏 104 键','https://picsum.photos/seed/g111/400/400','青轴',119.00,1,119.00,0,'2026-09-03 16:15:46'),(10,907,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,1,3799.00,0,'2026-09-07 12:41:51'),(11,908,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:49:17'),(12,909,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:49:25'),(13,910,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:52:50'),(14,910,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 12:52:50'),(15,910,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 12:52:50'),(16,911,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:52:58'),(17,912,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:54:21'),(18,912,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 12:54:21'),(19,912,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 12:54:21'),(20,913,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:56:31'),(21,913,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 12:56:31'),(22,913,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 12:56:31'),(23,914,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 12:56:31'),(24,915,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 12:56:32'),(25,916,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 12:58:08'),(26,916,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 12:58:08'),(27,916,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 12:58:08'),(28,917,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 12:58:09'),(29,918,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 12:58:09'),(30,919,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 13:01:59'),(31,919,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:01:59'),(32,919,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:01:59'),(33,920,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:02:00'),(34,921,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:02:00'),(35,922,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 13:02:08'),(36,923,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:02:09'),(37,924,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:02:09'),(38,925,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 13:02:35'),(39,925,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:02:35'),(40,925,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:02:35'),(41,926,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:02:36'),(42,927,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:02:36'),(43,928,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-07 13:07:40'),(44,928,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:07:40'),(45,928,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:07:40'),(46,929,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-07 13:07:41'),(47,930,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-07 13:07:41'),(48,931,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 20:00:57'),(49,931,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:00:57'),(50,931,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:00:57'),(51,932,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:00:58'),(52,933,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:00:58'),(53,934,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 20:02:01'),(54,935,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:02:02'),(55,936,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:02:02'),(56,937,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 20:02:15'),(57,938,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 20:02:31'),(58,938,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:02:31'),(59,938,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:02:31'),(60,939,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:02:32'),(61,940,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:02:32'),(62,941,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 20:05:10'),(63,941,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:05:10'),(64,941,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:05:10'),(65,942,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 20:05:11'),(66,943,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 20:05:11'),(67,944,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 22:21:26'),(68,944,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 22:21:26'),(69,944,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 22:21:26'),(70,945,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 22:21:28'),(71,946,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 22:21:28'),(72,947,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 22:37:43'),(73,947,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 22:37:43'),(74,947,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 22:37:43'),(75,948,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 22:37:44'),(76,949,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 22:37:44'),(77,950,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 23:22:12'),(78,950,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 23:22:12'),(79,950,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 23:22:12'),(80,951,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 23:22:13'),(81,952,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 23:22:13'),(82,953,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 23:23:51'),(83,953,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 23:23:51'),(84,953,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 23:23:51'),(85,954,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 23:23:52'),(86,955,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 23:23:52'),(87,956,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-09 23:25:06'),(88,956,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 23:25:06'),(89,956,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 23:25:06'),(90,957,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-09 23:25:07'),(91,958,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-09 23:25:07'),(92,959,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-10 00:19:34'),(93,959,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-10 00:19:34'),(94,959,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 00:19:34'),(95,960,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-10 00:19:35'),(96,961,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 00:19:35'),(97,962,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-10 00:46:17'),(98,962,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-10 00:46:17'),(99,962,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 00:46:17'),(100,963,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-10 00:46:18'),(101,964,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 00:46:18'),(102,965,8,26,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;8+256G',3799.00,3,11397.00,0,'2026-09-10 19:17:21'),(103,965,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-10 19:17:21'),(104,965,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 19:17:21'),(105,966,8,27,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;12+512G',3849.00,1,3849.00,0,'2026-09-10 19:17:22'),(106,967,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 19:17:22'),(107,968,8,28,'旗舰 5G 智能手机 骁龙8 16GB+512GB','','曜石黑;16+1T',3899.00,1,3899.00,0,'2026-09-10 19:19:04');
/*!40000 ALTER TABLE `order_goods` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_info`
--

DROP TABLE IF EXISTS `order_info`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_info` (
  `order_id` int unsigned NOT NULL AUTO_INCREMENT,
  `order_no` varchar(32) NOT NULL DEFAULT '' COMMENT '订单号',
  `user_id` int NOT NULL,
  `total_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '商品总价',
  `coupon_money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '优惠券抵扣',
  `freight_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '运费',
  `order_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '应付金额',
  `pay_price` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '实付金额',
  `pay_status` tinyint NOT NULL DEFAULT '0' COMMENT '0未付 1已付 2退款',
  `pay_type` tinyint NOT NULL DEFAULT '20' COMMENT '10余额 20微信',
  `pay_time` datetime DEFAULT NULL,
  `order_status` tinyint NOT NULL DEFAULT '10' COMMENT '10待付款 20待发货 30待收货 40已完成 50已取消',
  `delivery_status` tinyint NOT NULL DEFAULT '0' COMMENT '0未发货 1已发货 2已收货',
  `delivery_time` datetime DEFAULT NULL,
  `receipt_time` datetime DEFAULT NULL,
  `consignee_name` varchar(30) NOT NULL DEFAULT '',
  `consignee_phone` varchar(20) NOT NULL DEFAULT '',
  `consignee_address` varchar(300) NOT NULL DEFAULT '' COMMENT '收货地址快照',
  `express_id` int NOT NULL DEFAULT '0',
  `express_company` varchar(30) NOT NULL DEFAULT '',
  `express_no` varchar(50) NOT NULL DEFAULT '' COMMENT '物流单号',
  `coupon_id` int NOT NULL DEFAULT '0' COMMENT '使用的用户券ID',
  `user_remark` varchar(200) NOT NULL DEFAULT '' COMMENT '买家留言',
  `cancel_time` datetime DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  `is_delete` tinyint NOT NULL DEFAULT '0',
  PRIMARY KEY (`order_id`),
  UNIQUE KEY `uk_order_no` (`order_no`),
  KEY `idx_user_status` (`user_id`,`order_status`)
) ENGINE=InnoDB AUTO_INCREMENT=969 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='订单';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_info`
--

LOCK TABLES `order_info` WRITE;
/*!40000 ALTER TABLE `order_info` DISABLE KEYS */;
INSERT INTO `order_info` VALUES (901,'2024081001',2,51.00,0.00,10.00,61.00,0.00,0,20,NULL,10,0,NULL,NULL,'张三','13800000001','陕西省西安市雁塔区高新路88号',0,'','',0,'','2026-09-10 19:17:21','2026-09-03 16:15:46','2026-09-10 19:17:21',0),(902,'2024081002',2,5298.00,0.00,0.00,5298.00,5298.00,1,20,'2026-09-03 16:15:46',20,0,NULL,NULL,'张三','13800000001','陕西省西安市雁塔区高新路88号',0,'','',0,'',NULL,'2026-09-03 16:15:46','2026-09-03 16:15:46',0),(903,'2024081003',2,10596.00,0.00,0.00,10596.00,10596.00,1,20,'2026-09-03 16:15:46',30,1,'2026-09-03 16:15:46','2026-09-10 19:17:21','张三','13800000001','陕西省西安市雁塔区高新路88号',1,'顺丰速运','SF100003',0,'',NULL,'2026-09-03 16:15:46','2026-09-10 19:17:21',0),(904,'2024081004',2,40.90,0.00,10.00,50.90,50.90,1,20,'2026-09-03 16:15:46',40,2,'2026-09-03 16:15:46','2026-09-03 16:15:46','张三','13800000001','陕西省西安市雁塔区高新路88号',1,'顺丰速运','SF100004',0,'',NULL,'2026-09-03 16:15:46','2026-09-03 16:15:46',0),(905,'2024081005',2,2349.00,0.00,0.00,2349.00,2349.00,1,20,'2026-09-03 16:15:46',40,2,'2026-09-03 16:15:46','2026-09-03 16:15:46','张三','13800000001','陕西省西安市雁塔区高新路88号',1,'顺丰速运','SF100003',0,'',NULL,'2026-09-03 16:15:46','2026-09-03 16:15:46',0),(906,'2024081006',2,119.00,0.00,0.00,119.00,0.00,0,20,'2026-09-10 19:18:33',10,0,NULL,NULL,'张三','13800000001','陕西省西安市雁塔区高新路88号',0,'','',0,'','2026-09-03 16:15:46','2026-09-03 16:15:46','2026-09-10 19:18:33',0),(907,'20260907124151419722',2,3799.00,0.00,0.00,3799.00,3799.00,1,20,'2026-09-07 12:41:51',20,0,NULL,NULL,'李四','13800000002','广东省深圳市南山区科技园科兴科学园 A 座 2202',0,'','',0,'自动化测试',NULL,'2026-09-07 12:41:51','2026-09-07 12:41:51',0),(908,'20260907124917358594',2,11397.00,0.00,0.00,11397.00,11397.00,1,20,'2026-09-07 12:49:17',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:49:17','2026-09-07 12:49:17',0),(909,'20260907124925677953',2,11397.00,0.00,0.00,11397.00,11397.00,1,20,'2026-09-07 12:49:25',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:49:25','2026-09-07 12:49:25',0),(910,'20260907125250695938',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 12:52:50',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:52:50','2026-09-07 12:52:50',0),(911,'20260907125258472665',2,11397.00,0.00,0.00,11397.00,11397.00,1,20,'2026-09-07 12:52:58',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:52:58','2026-09-07 12:52:58',0),(912,'20260907125421496898',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 12:54:21',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:54:21','2026-09-07 12:54:21',0),(913,'20260907125631866223',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 12:56:31',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:56:31','2026-09-07 12:56:31',0),(914,'20260907125631412007',2,3849.00,0.00,0.00,3849.00,3849.00,0,20,NULL,10,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:56:31','2026-09-07 12:56:31',0),(915,'20260907125632213211',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,10,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:56:32','2026-09-07 12:56:32',0),(916,'20260907125808586411',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 12:58:08',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:58:08','2026-09-07 12:58:08',0),(917,'20260907125809288166',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-07 12:58:09',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 12:58:09','2026-09-07 12:58:09',0),(918,'20260907125809525852',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-07 12:58:09','2026-09-07 12:58:09','2026-09-07 12:58:09',0),(919,'20260907130159933573',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 13:01:59',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:01:59','2026-09-07 13:01:59',0),(920,'20260907130200797987',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-07 13:02:00',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:02:00','2026-09-07 13:02:00',0),(921,'20260907130200634088',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-07 13:02:00','2026-09-07 13:02:00','2026-09-07 13:02:00',0),(922,'20260907130208586149',2,11397.00,0.00,0.00,11397.00,11397.00,1,20,'2026-09-07 13:02:08',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:02:08','2026-09-07 13:02:08',0),(923,'20260907130209637487',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-07 13:02:09',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:02:09','2026-09-07 13:02:09',0),(924,'20260907130209837406',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-07 13:02:09','2026-09-07 13:02:09','2026-09-07 13:02:09',0),(925,'20260907130235648589',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 13:02:35',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:02:35','2026-09-07 13:02:35',0),(926,'20260907130236346855',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-07 13:02:36',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:02:36','2026-09-07 13:02:36',0),(927,'20260907130236971536',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-07 13:02:36','2026-09-07 13:02:36','2026-09-07 13:02:36',0),(928,'20260907130740607989',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-07 13:07:40',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:07:40','2026-09-07 13:07:40',0),(929,'20260907130741121466',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-07 13:07:41',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-07 13:07:41','2026-09-07 13:07:41',0),(930,'20260907130741813700',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-07 13:07:41','2026-09-07 13:07:41','2026-09-07 13:07:41',0),(931,'20260909200057736021',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 20:00:57',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:00:57','2026-09-09 20:00:57',0),(932,'20260909200058353818',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 20:00:58',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:00:58','2026-09-09 20:00:58',0),(933,'20260909200058906641',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 20:00:58','2026-09-09 20:00:58','2026-09-09 20:00:58',0),(934,'20260909200201659168',2,11397.00,0.00,0.00,11397.00,11397.00,1,20,'2026-09-09 20:02:01',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:02:01','2026-09-09 20:02:01',0),(935,'20260909200202910598',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 20:02:02',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:02:02','2026-09-09 20:02:02',0),(936,'20260909200202626825',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 20:02:02','2026-09-09 20:02:02','2026-09-09 20:02:02',0),(937,'20260909200215145576',2,11397.00,0.00,0.00,11397.00,11397.00,1,20,'2026-09-09 20:02:15',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:02:15','2026-09-09 20:02:15',0),(938,'20260909200231926624',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 20:02:31',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:02:31','2026-09-09 20:02:31',0),(939,'20260909200232371588',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 20:02:32',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:02:32','2026-09-09 20:02:32',0),(940,'20260909200232614189',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 20:02:32','2026-09-09 20:02:32','2026-09-09 20:02:32',0),(941,'20260909200510555859',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 20:05:10',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:05:10','2026-09-09 20:05:10',0),(942,'20260909200511307579',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 20:05:11',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 20:05:11','2026-09-09 20:05:11',0),(943,'20260909200511862160',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 20:05:11','2026-09-09 20:05:11','2026-09-09 20:05:11',0),(944,'20260909222126233737',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 22:21:26',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 22:21:26','2026-09-09 22:21:26',0),(945,'20260909222128101108',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 22:21:28',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 22:21:28','2026-09-09 22:21:28',0),(946,'20260909222128293374',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 22:21:28','2026-09-09 22:21:28','2026-09-09 22:21:28',0),(947,'20260909223743885210',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 22:37:43',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 22:37:43','2026-09-09 22:37:43',0),(948,'20260909223744190660',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 22:37:44',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 22:37:44','2026-09-09 22:37:44',0),(949,'20260909223744896531',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 22:37:44','2026-09-09 22:37:44','2026-09-09 22:37:44',0),(950,'20260909232212663127',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 23:22:12',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 23:22:12','2026-09-09 23:22:12',0),(951,'20260909232213858296',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 23:22:13',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 23:22:13','2026-09-09 23:22:13',0),(952,'20260909232213721722',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 23:22:13','2026-09-09 23:22:13','2026-09-09 23:22:13',0),(953,'20260909232351870479',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 23:23:51',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 23:23:51','2026-09-09 23:23:51',0),(954,'20260909232352568408',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 23:23:52',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 23:23:52','2026-09-09 23:23:52',0),(955,'20260909232352319961',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 23:23:52','2026-09-09 23:23:52','2026-09-09 23:23:52',0),(956,'20260909232506469720',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-09 23:25:06',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 23:25:06','2026-09-09 23:25:06',0),(957,'20260909232507396352',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-09 23:25:07',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-09 23:25:07','2026-09-09 23:25:07',0),(958,'20260909232507148680',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-09 23:25:07','2026-09-09 23:25:07','2026-09-09 23:25:07',0),(959,'20260910001934436037',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-10 00:19:34',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-10 00:19:34','2026-09-10 00:19:34',0),(960,'20260910001935382747',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-10 00:19:35',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-10 00:19:35','2026-09-10 00:19:35',0),(961,'20260910001935742334',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-10 00:19:35','2026-09-10 00:19:35','2026-09-10 00:19:35',0),(962,'20260910004617867760',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-10 00:46:17',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-10 00:46:17','2026-09-10 00:46:17',0),(963,'20260910004618666313',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-10 00:46:18',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-10 00:46:18','2026-09-10 00:46:18',0),(964,'20260910004618853764',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-10 00:46:18','2026-09-10 00:46:18','2026-09-10 00:46:18',0),(965,'20260910191721559507',2,19145.00,0.00,0.00,19145.00,19145.00,1,20,'2026-09-10 19:17:21',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-10 19:17:21','2026-09-10 19:17:21',0),(966,'20260910191722678943',2,3849.00,0.00,0.00,3849.00,3849.00,1,20,'2026-09-10 19:17:22',20,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'',NULL,'2026-09-10 19:17:22','2026-09-10 19:17:22',0),(967,'20260910191722900527',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-10 19:17:22','2026-09-10 19:17:22','2026-09-10 19:17:22',0),(968,'20260910191904456774',2,3899.00,0.00,0.00,3899.00,3899.00,0,20,NULL,50,0,NULL,NULL,'张三改','13800000001','陕西省西安市雁塔区更新地址',0,'','',0,'','2026-09-10 19:19:04','2026-09-10 19:19:04','2026-09-10 19:19:04',0);
/*!40000 ALTER TABLE `order_info` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order_refund`
--

DROP TABLE IF EXISTS `order_refund`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order_refund` (
  `refund_id` int unsigned NOT NULL AUTO_INCREMENT,
  `refund_no` varchar(32) NOT NULL DEFAULT '',
  `order_id` int NOT NULL,
  `order_goods_id` int NOT NULL,
  `user_id` int NOT NULL,
  `refund_type` tinyint NOT NULL DEFAULT '10' COMMENT '10仅退款 20退货退款',
  `reason` varchar(200) NOT NULL DEFAULT '' COMMENT '退款原因',
  `remark` varchar(500) NOT NULL DEFAULT '' COMMENT '问题描述',
  `goods_num` int NOT NULL DEFAULT '1',
  `refund_money` decimal(10,2) NOT NULL DEFAULT '0.00',
  `state` tinyint NOT NULL DEFAULT '10' COMMENT '10待审核 20待买家发货 30待商家收货 40已完成 50已拒绝',
  `express_company` varchar(30) NOT NULL DEFAULT '',
  `express_no` varchar(50) NOT NULL DEFAULT '',
  `delivery_time` datetime DEFAULT NULL,
  `audit_time` datetime DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`refund_id`),
  KEY `idx_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='售后单';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order_refund`
--

LOCK TABLES `order_refund` WRITE;
/*!40000 ALTER TABLE `order_refund` DISABLE KEYS */;
/*!40000 ALTER TABLE `order_refund` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `points_log`
--

DROP TABLE IF EXISTS `points_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `points_log` (
  `log_id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `value` int NOT NULL DEFAULT '0' COMMENT '正=获得 负=消耗',
  `points_after` int NOT NULL DEFAULT '0' COMMENT '变动后积分',
  `remark` varchar(100) NOT NULL DEFAULT '',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`log_id`),
  KEY `idx_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='积分明细';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `points_log`
--

LOCK TABLES `points_log` WRITE;
/*!40000 ALTER TABLE `points_log` DISABLE KEYS */;
INSERT INTO `points_log` VALUES (1,1,100,100,'签到奖励','2026-08-29 16:15:46'),(2,1,1180,1280,'订单赠送积分','2026-08-31 16:15:46'),(3,1,0,1280,'积分兑换抵扣','2026-09-02 16:15:46'),(4,2,3799,4159,'订单赠送积分 20260907124151419722','2026-09-07 12:41:51'),(5,2,11397,15556,'订单赠送积分 20260907124917358594','2026-09-07 12:49:17'),(6,2,11397,26953,'订单赠送积分 20260907124925677953','2026-09-07 12:49:25'),(7,2,19145,46098,'订单赠送积分 20260907125250695938','2026-09-07 12:52:50'),(8,2,11397,57495,'订单赠送积分 20260907125258472665','2026-09-07 12:52:58'),(9,2,19145,76640,'订单赠送积分 20260907125421496898','2026-09-07 12:54:21'),(10,2,19145,95785,'订单赠送积分 20260907125631866223','2026-09-07 12:56:31'),(11,2,19145,114930,'订单赠送积分 20260907125808586411','2026-09-07 12:58:08'),(12,2,3849,118779,'订单赠送积分 20260907125809288166','2026-09-07 12:58:09'),(13,2,19145,137924,'订单赠送积分 20260907130159933573','2026-09-07 13:01:59'),(14,2,3849,141773,'订单赠送积分 20260907130200797987','2026-09-07 13:02:00'),(15,2,11397,153170,'订单赠送积分 20260907130208586149','2026-09-07 13:02:08'),(16,2,3849,157019,'订单赠送积分 20260907130209637487','2026-09-07 13:02:09'),(17,2,19145,176164,'订单赠送积分 20260907130235648589','2026-09-07 13:02:35'),(18,2,3849,180013,'订单赠送积分 20260907130236346855','2026-09-07 13:02:36'),(19,2,19145,199158,'订单赠送积分 20260907130740607989','2026-09-07 13:07:40'),(20,2,3849,203007,'订单赠送积分 20260907130741121466','2026-09-07 13:07:41'),(21,2,19145,222152,'订单赠送积分 20260909200057736021','2026-09-09 20:00:57'),(22,2,3849,226001,'订单赠送积分 20260909200058353818','2026-09-09 20:00:58'),(23,2,11397,237398,'订单赠送积分 20260909200201659168','2026-09-09 20:02:01'),(24,2,3849,241247,'订单赠送积分 20260909200202910598','2026-09-09 20:02:02'),(25,2,11397,252644,'订单赠送积分 20260909200215145576','2026-09-09 20:02:15'),(26,2,19145,271789,'订单赠送积分 20260909200231926624','2026-09-09 20:02:31'),(27,2,3849,275638,'订单赠送积分 20260909200232371588','2026-09-09 20:02:32'),(28,2,19145,294783,'订单赠送积分 20260909200510555859','2026-09-09 20:05:10'),(29,2,3849,298632,'订单赠送积分 20260909200511307579','2026-09-09 20:05:11'),(30,2,19145,317777,'订单赠送积分 20260909222126233737','2026-09-09 22:21:26'),(31,2,3849,321626,'订单赠送积分 20260909222128101108','2026-09-09 22:21:28'),(32,2,19145,340771,'订单赠送积分 20260909223743885210','2026-09-09 22:37:43'),(33,2,3849,344620,'订单赠送积分 20260909223744190660','2026-09-09 22:37:44'),(34,2,19145,363765,'订单赠送积分 20260909232212663127','2026-09-09 23:22:12'),(35,2,3849,367614,'订单赠送积分 20260909232213858296','2026-09-09 23:22:13'),(36,2,19145,386759,'订单赠送积分 20260909232351870479','2026-09-09 23:23:51'),(37,2,3849,390608,'订单赠送积分 20260909232352568408','2026-09-09 23:23:52'),(38,2,19145,409753,'订单赠送积分 20260909232506469720','2026-09-09 23:25:06'),(39,2,3849,413602,'订单赠送积分 20260909232507396352','2026-09-09 23:25:07'),(40,2,19145,432747,'订单赠送积分 20260910001934436037','2026-09-10 00:19:34'),(41,2,3849,436596,'订单赠送积分 20260910001935382747','2026-09-10 00:19:35'),(42,2,19145,455741,'订单赠送积分 20260910004617867760','2026-09-10 00:46:17'),(43,2,3849,459590,'订单赠送积分 20260910004618666313','2026-09-10 00:46:18'),(44,2,19145,478735,'订单赠送积分 20260910191721559507','2026-09-10 19:17:21'),(45,2,3849,482584,'订单赠送积分 20260910191722678943','2026-09-10 19:17:22');
/*!40000 ALTER TABLE `points_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recharge_order`
--

DROP TABLE IF EXISTS `recharge_order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recharge_order` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `order_no` varchar(32) NOT NULL DEFAULT '',
  `user_id` int NOT NULL,
  `plan_id` int NOT NULL DEFAULT '0',
  `pay_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `gift_money` decimal(10,2) NOT NULL DEFAULT '0.00',
  `pay_status` tinyint NOT NULL DEFAULT '0' COMMENT '0未付 1已付',
  `pay_type` tinyint NOT NULL DEFAULT '20',
  `create_time` datetime DEFAULT NULL,
  `pay_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='充值订单';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recharge_order`
--

LOCK TABLES `recharge_order` WRITE;
/*!40000 ALTER TABLE `recharge_order` DISABLE KEYS */;
INSERT INTO `recharge_order` VALUES (1,'RC20260907122938234642',2,1,50.00,0.00,1,20,'2026-09-07 12:29:38','2026-09-07 12:29:38'),(2,'RC20260907122939931609',2,1,50.00,0.00,1,20,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(3,'RC20260907123502882455',2,1,50.00,0.00,1,20,'2026-09-07 12:35:02','2026-09-07 12:35:02'),(4,'RC20260907123503414721',2,1,50.00,0.00,1,20,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(5,'RC20260907123514768981',2,1,50.00,0.00,1,20,'2026-09-07 12:35:14','2026-09-07 12:35:14'),(6,'RC20260907124151742168',2,1,50.00,0.00,1,20,'2026-09-07 12:41:51','2026-09-07 12:41:51'),(7,'RC20260907124152309284',2,1,50.00,0.00,1,20,'2026-09-07 12:41:52','2026-09-07 12:41:52'),(8,'RC20260907124208415521',2,1,50.00,0.00,1,20,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(9,'RC20260907124208105326',2,1,50.00,0.00,1,20,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(10,'RC20260907124917822920',2,1,50.00,0.00,1,20,'2026-09-07 12:49:17','2026-09-07 12:49:17'),(11,'RC20260907124918862645',2,1,50.00,0.00,1,20,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(12,'RC20260907124925677547',2,1,50.00,0.00,1,20,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(13,'RC20260907124925935758',2,1,50.00,0.00,1,20,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(14,'RC20260907125250158531',2,1,50.00,0.00,1,20,'2026-09-07 12:52:50','2026-09-07 12:52:50'),(15,'RC20260907125251433476',2,1,50.00,0.00,1,20,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(16,'RC20260907125258656166',2,1,50.00,0.00,1,20,'2026-09-07 12:52:58','2026-09-07 12:52:58'),(17,'RC20260907125259300018',2,1,50.00,0.00,1,20,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(18,'RC20260907125421740834',2,1,50.00,0.00,1,20,'2026-09-07 12:54:21','2026-09-07 12:54:21'),(19,'RC20260907125422884839',2,1,50.00,0.00,1,20,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(20,'RC20260907125631924568',2,1,50.00,0.00,1,20,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(21,'RC20260907125632487834',2,1,50.00,0.00,1,20,'2026-09-07 12:56:32','2026-09-07 12:56:32'),(22,'RC20260907125808579951',2,1,50.00,0.00,1,20,'2026-09-07 12:58:08','2026-09-07 12:58:08'),(23,'RC20260907125810982865',2,1,50.00,0.00,1,20,'2026-09-07 12:58:10','2026-09-07 12:58:10'),(24,'RC20260907130159103252',2,1,50.00,0.00,1,20,'2026-09-07 13:01:59','2026-09-07 13:01:59'),(25,'RC20260907130200876527',2,1,50.00,0.00,1,20,'2026-09-07 13:02:00','2026-09-07 13:02:00'),(26,'RC20260907130208844510',2,1,50.00,0.00,1,20,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(27,'RC20260907130209735515',2,1,50.00,0.00,1,20,'2026-09-07 13:02:09','2026-09-07 13:02:09'),(28,'RC20260907130235154869',2,1,50.00,0.00,1,20,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(29,'RC20260907130236981174',2,1,50.00,0.00,1,20,'2026-09-07 13:02:36','2026-09-07 13:02:36'),(30,'RC20260907130740171482',2,1,50.00,0.00,1,20,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(31,'RC20260907130741212501',2,1,50.00,0.00,1,20,'2026-09-07 13:07:41','2026-09-07 13:07:41'),(32,'RC20260909200057348958',2,1,50.00,0.00,1,20,'2026-09-09 20:00:57','2026-09-09 20:00:57'),(33,'RC20260909200058435601',2,1,50.00,0.00,1,20,'2026-09-09 20:00:58','2026-09-09 20:00:58'),(34,'RC20260909200201728260',2,1,50.00,0.00,1,20,'2026-09-09 20:02:01','2026-09-09 20:02:01'),(35,'RC20260909200203223965',2,1,50.00,0.00,1,20,'2026-09-09 20:02:03','2026-09-09 20:02:03'),(36,'RC20260909200231112251',2,1,50.00,0.00,1,20,'2026-09-09 20:02:31','2026-09-09 20:02:31'),(37,'RC20260909200232184957',2,1,50.00,0.00,1,20,'2026-09-09 20:02:32','2026-09-09 20:02:32'),(38,'RC20260909200510841050',2,1,50.00,0.00,1,20,'2026-09-09 20:05:10','2026-09-09 20:05:10'),(39,'RC20260909200511745582',2,1,50.00,0.00,1,20,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(40,'RC20260909222127311910',2,1,50.00,0.00,1,20,'2026-09-09 22:21:27','2026-09-09 22:21:27'),(41,'RC20260909222129459814',2,1,50.00,0.00,1,20,'2026-09-09 22:21:29','2026-09-09 22:21:29'),(42,'RC20260909223743465392',2,1,50.00,0.00,1,20,'2026-09-09 22:37:43','2026-09-09 22:37:43'),(43,'RC20260909223745712227',2,1,50.00,0.00,1,20,'2026-09-09 22:37:45','2026-09-09 22:37:45'),(44,'RC20260909232212717941',2,1,50.00,0.00,1,20,'2026-09-09 23:22:12','2026-09-09 23:22:12'),(45,'RC20260909232213947308',2,1,50.00,0.00,1,20,'2026-09-09 23:22:13','2026-09-09 23:22:13'),(46,'RC20260909232351333524',2,1,50.00,0.00,1,20,'2026-09-09 23:23:51','2026-09-09 23:23:51'),(47,'RC20260909232352788147',2,1,50.00,0.00,1,20,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(48,'RC20260909232506157614',2,1,50.00,0.00,1,20,'2026-09-09 23:25:06','2026-09-09 23:25:06'),(49,'RC20260909232508269646',2,1,50.00,0.00,1,20,'2026-09-09 23:25:08','2026-09-09 23:25:08'),(50,'RC20260910001935519193',2,1,50.00,0.00,1,20,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(51,'RC20260910001936461474',2,1,50.00,0.00,1,20,'2026-09-10 00:19:36','2026-09-10 00:19:36'),(52,'RC20260910004618334214',2,1,50.00,0.00,1,20,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(53,'RC20260910004619578263',2,1,50.00,0.00,1,20,'2026-09-10 00:46:19','2026-09-10 00:46:19'),(54,'RC20260910191721732164',2,1,50.00,0.00,1,20,'2026-09-10 19:17:21','2026-09-10 19:17:21'),(55,'RC20260910191722803735',2,1,50.00,0.00,1,20,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(56,'RC20260910191732563707',2,1,50.00,0.00,1,20,'2026-09-10 19:17:32','2026-09-10 19:17:32'),(57,'RC20260910191815542983',2,1,50.00,0.00,1,20,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(58,'RC20260910191833537105',2,1,50.00,0.00,1,20,'2026-09-10 19:18:33','2026-09-10 19:18:33'),(59,'RC20260910191904812712',2,1,50.00,0.00,1,20,'2026-09-10 19:19:04','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `recharge_order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recharge_plan`
--

DROP TABLE IF EXISTS `recharge_plan`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `recharge_plan` (
  `plan_id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL DEFAULT '',
  `money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '充值金额',
  `gift_money` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '赠送金额',
  `sort` int NOT NULL DEFAULT '100',
  `status` tinyint NOT NULL DEFAULT '10',
  PRIMARY KEY (`plan_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='充值套餐';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recharge_plan`
--

LOCK TABLES `recharge_plan` WRITE;
/*!40000 ALTER TABLE `recharge_plan` DISABLE KEYS */;
INSERT INTO `recharge_plan` VALUES (1,'充50元',50.00,0.00,100,10),(2,'充100送5元',100.00,5.00,100,10),(3,'充200送15元',200.00,15.00,100,10),(4,'充500送50元',500.00,50.00,100,10);
/*!40000 ALTER TABLE `recharge_plan` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `region`
--

DROP TABLE IF EXISTS `region`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `region` (
  `region_id` int NOT NULL,
  `parent_id` int NOT NULL DEFAULT '0',
  `name` varchar(50) NOT NULL DEFAULT '',
  `short_name` varchar(50) NOT NULL DEFAULT '',
  `level` tinyint NOT NULL DEFAULT '1' COMMENT '1省 2市 3区县',
  PRIMARY KEY (`region_id`),
  KEY `idx_parent` (`parent_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='地区';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `region`
--

LOCK TABLES `region` WRITE;
/*!40000 ALTER TABLE `region` DISABLE KEYS */;
INSERT INTO `region` VALUES (100000,0,'北京市','北京',1),(100001,100000,'北京市','北京',2),(100002,100001,'东城区','东城区',3),(100003,100001,'西城区','西城区',3),(100004,100001,'朝阳区','朝阳区',3),(100005,100001,'海淀区','海淀区',3),(100006,100001,'丰台区','丰台区',3),(100007,0,'上海市','上海',1),(100008,100007,'上海市','上海',2),(100009,100008,'黄浦区','黄浦区',3),(100010,100008,'徐汇区','徐汇区',3),(100011,100008,'长宁区','长宁区',3),(100012,100008,'静安区','静安区',3),(100013,100008,'浦东新区','浦东新区',3),(100014,0,'天津市','天津',1),(100015,100014,'天津市','天津',2),(100016,100015,'和平区','和平区',3),(100017,100015,'河东区','河东区',3),(100018,100015,'南开区','南开区',3),(100019,100015,'滨海新区','滨海新区',3),(100020,0,'重庆市','重庆',1),(100021,100020,'重庆市','重庆',2),(100022,100021,'渝中区','渝中区',3),(100023,100021,'江北区','江北区',3),(100024,100021,'沙坪坝区','沙坪坝区',3),(100025,100021,'渝北区','渝北区',3),(100026,0,'广东省','广东',1),(100027,100026,'广州市','广州',2),(100028,100027,'越秀区','越秀区',3),(100029,100027,'海珠区','海珠区',3),(100030,100027,'天河区','天河区',3),(100031,100027,'白云区','白云区',3),(100032,100026,'深圳市','深圳',2),(100033,100032,'福田区','福田区',3),(100034,100032,'罗湖区','罗湖区',3),(100035,100032,'南山区','南山区',3),(100036,100032,'宝安区','宝安区',3),(100037,100026,'东莞市','东莞',2),(100038,100037,'莞城街道','莞城街道',3),(100039,100037,'南城街道','南城街道',3),(100040,0,'陕西省','陕西',1),(100041,100040,'西安市','西安',2),(100042,100041,'新城区','新城区',3),(100043,100041,'碑林区','碑林区',3),(100044,100041,'莲湖区','莲湖区',3),(100045,100041,'雁塔区','雁塔区',3),(100046,100041,'未央区','未央区',3),(100047,100041,'长安区','长安区',3),(100048,100040,'宝鸡市','宝鸡',2),(100049,100048,'渭滨区','渭滨区',3),(100050,100048,'金台区','金台区',3),(100051,100040,'咸阳市','咸阳',2),(100052,100051,'秦都区','秦都区',3),(100053,100051,'渭城区','渭城区',3),(100054,0,'浙江省','浙江',1),(100055,100054,'杭州市','杭州',2),(100056,100055,'上城区','上城区',3),(100057,100055,'拱墅区','拱墅区',3),(100058,100055,'西湖区','西湖区',3),(100059,100055,'滨江区','滨江区',3),(100060,100055,'余杭区','余杭区',3),(100061,100054,'宁波市','宁波',2),(100062,100061,'海曙区','海曙区',3),(100063,100061,'江北区','江北区',3),(100064,100061,'鄞州区','鄞州区',3),(100065,0,'江苏省','江苏',1),(100066,100065,'南京市','南京',2),(100067,100066,'玄武区','玄武区',3),(100068,100066,'秦淮区','秦淮区',3),(100069,100066,'鼓楼区','鼓楼区',3),(100070,100066,'建邺区','建邺区',3),(100071,100065,'苏州市','苏州',2),(100072,100071,'姑苏区','姑苏区',3),(100073,100071,'吴中区','吴中区',3),(100074,100071,'工业园区','工业园区',3),(100075,0,'四川省','四川',1),(100076,100075,'成都市','成都',2),(100077,100076,'锦江区','锦江区',3),(100078,100076,'青羊区','青羊区',3),(100079,100076,'金牛区','金牛区',3),(100080,100076,'武侯区','武侯区',3),(100081,100076,'高新区','高新区',3);
/*!40000 ALTER TABLE `region` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `setting`
--

DROP TABLE IF EXISTS `setting`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `setting` (
  `setting_key` varchar(50) NOT NULL,
  `setting_value` text,
  PRIMARY KEY (`setting_key`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='商城设置';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `setting`
--

LOCK TABLES `setting` WRITE;
/*!40000 ALTER TABLE `setting` DISABLE KEYS */;
INSERT INTO `setting` VALUES ('about','智慧商城是一个用于接口测试学习的演示商城。'),('defaultAvatar','https://picsum.photos/seed/defaultavatar/100/100'),('freight','0.00'),('freightRule','满99元包邮，否则运费10元'),('pointsName','积分'),('pointsRatio','100积分抵扣1元'),('serviceMobile','400-888-0000'),('shopLogo','https://picsum.photos/seed/logo/200/200'),('shopName','智慧商城');
/*!40000 ALTER TABLE `setting` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sms_log`
--

DROP TABLE IF EXISTS `sms_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sms_log` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `mobile` varchar(11) NOT NULL DEFAULT '',
  `code` varchar(6) NOT NULL DEFAULT '',
  `scene` varchar(30) NOT NULL DEFAULT 'login',
  `is_used` tinyint NOT NULL DEFAULT '0',
  `expire_time` datetime DEFAULT NULL,
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_mobile` (`mobile`)
) ENGINE=InnoDB AUTO_INCREMENT=137 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='短信验证码';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sms_log`
--

LOCK TABLES `sms_log` WRITE;
/*!40000 ALTER TABLE `sms_log` DISABLE KEYS */;
INSERT INTO `sms_log` VALUES (1,'13800000001','999414','login',0,'2026-09-05 13:28:41','2026-09-05 13:23:41'),(2,'13800000001','011969','login',0,'2026-09-05 13:36:45','2026-09-05 13:31:45'),(3,'13800000001','457456','login',0,'2026-09-05 13:40:33','2026-09-05 13:35:33'),(4,'13800000001','643564','login',0,'2026-09-05 13:42:07','2026-09-05 13:37:07'),(5,'13800000001','316420','login',0,'2026-09-05 13:44:23','2026-09-05 13:39:23'),(6,'13800000001','116929','login',0,'2026-09-05 13:48:15','2026-09-05 13:43:15'),(7,'13800000001','914696','login',0,'2026-09-06 00:21:34','2026-09-06 00:16:34'),(8,'13800000001','948240','login',0,'2026-09-06 00:23:56','2026-09-06 00:18:56'),(9,'13800000001','740423','login',0,'2026-09-06 00:24:08','2026-09-06 00:19:08'),(10,'13800000001','783665','login',0,'2026-09-06 00:25:12','2026-09-06 00:20:12'),(11,'13800000001','653217','login',0,'2026-09-06 00:26:26','2026-09-06 00:21:26'),(12,'13800000001','826697','login',0,'2026-09-06 00:29:20','2026-09-06 00:24:20'),(13,'13800000001','219938','login',0,'2026-09-07 12:32:43','2026-09-07 12:27:43'),(14,'13800000001','878087','login',0,'2026-09-07 12:34:38','2026-09-07 12:29:38'),(15,'13800000002','420494','xxx',0,'2026-09-07 12:34:39','2026-09-07 12:29:39'),(16,'13800000002','078333','login',1,'2026-09-07 12:34:39','2026-09-07 12:29:39'),(17,'13800000001','764848','login',0,'2026-09-07 12:40:02','2026-09-07 12:35:02'),(18,'13800000002','067070','xxx',0,'2026-09-07 12:40:03','2026-09-07 12:35:03'),(19,'13800000002','875408','login',0,'2026-09-07 12:40:03','2026-09-07 12:35:03'),(20,'13800000001','174329','login',0,'2026-09-07 12:40:13','2026-09-07 12:35:13'),(21,'13800000002','435177','login',1,'2026-09-07 12:40:14','2026-09-07 12:35:14'),(22,'13800000001','511147','login',0,'2026-09-07 12:40:32','2026-09-07 12:35:32'),(23,'13800000001','022551','login',0,'2026-09-07 12:46:51','2026-09-07 12:41:51'),(24,'13800000002','223224','xxx',0,'2026-09-07 12:46:51','2026-09-07 12:41:51'),(25,'13800000002','448724','login',1,'2026-09-07 12:46:52','2026-09-07 12:41:52'),(26,'13800000001','797687','login',0,'2026-09-07 12:47:08','2026-09-07 12:42:08'),(27,'13800000002','781752','xxx',0,'2026-09-07 12:47:08','2026-09-07 12:42:08'),(28,'13800000002','224245','login',1,'2026-09-07 12:47:08','2026-09-07 12:42:08'),(29,'13800000001','533430','login',0,'2026-09-07 12:54:17','2026-09-07 12:49:17'),(30,'13800000002','323580','login',0,'2026-09-07 12:54:17','2026-09-07 12:49:17'),(31,'13800000002','716905','login',1,'2026-09-07 12:54:18','2026-09-07 12:49:18'),(32,'13800000001','104446','login',0,'2026-09-07 12:54:24','2026-09-07 12:49:24'),(33,'13800000002','206953','login',0,'2026-09-07 12:54:25','2026-09-07 12:49:25'),(34,'13800000002','286941','login',0,'2026-09-07 12:54:25','2026-09-07 12:49:25'),(35,'13800000001','950982','login',0,'2026-09-07 12:57:50','2026-09-07 12:52:50'),(36,'13800000002','365821','login',1,'2026-09-07 12:57:50','2026-09-07 12:52:50'),(37,'13800000002','840969','login',0,'2026-09-07 12:57:51','2026-09-07 12:52:51'),(38,'13800000001','466840','login',0,'2026-09-07 12:57:58','2026-09-07 12:52:58'),(39,'13800000002','171426','login',1,'2026-09-07 12:57:59','2026-09-07 12:52:59'),(40,'13800000002','786309','login',0,'2026-09-07 12:57:59','2026-09-07 12:52:59'),(41,'13800000001','866531','login',0,'2026-09-07 12:59:21','2026-09-07 12:54:21'),(42,'13800000002','320064','login',1,'2026-09-07 12:59:21','2026-09-07 12:54:21'),(43,'13800000002','869344','login',0,'2026-09-07 12:59:22','2026-09-07 12:54:22'),(44,'13800000001','585425','login',0,'2026-09-07 13:01:30','2026-09-07 12:56:30'),(45,'13800000002','046693','login',1,'2026-09-07 13:01:31','2026-09-07 12:56:31'),(46,'13800000002','737922','xxx',0,'2026-09-07 13:01:31','2026-09-07 12:56:31'),(47,'13800000002','043015','login',0,'2026-09-07 13:01:32','2026-09-07 12:56:32'),(48,'13800000001','508644','login',0,'2026-09-07 13:03:08','2026-09-07 12:58:08'),(49,'13800000002','082236','login',1,'2026-09-07 13:03:09','2026-09-07 12:58:09'),(50,'13800000002','267403','xxx',0,'2026-09-07 13:03:09','2026-09-07 12:58:09'),(51,'13800000002','957118','login',0,'2026-09-07 13:03:10','2026-09-07 12:58:10'),(52,'13800000001','046761','login',0,'2026-09-07 13:06:59','2026-09-07 13:01:59'),(53,'13800000002','032604','login',1,'2026-09-07 13:06:59','2026-09-07 13:01:59'),(54,'13800000002','742505','xxx',0,'2026-09-07 13:06:59','2026-09-07 13:01:59'),(55,'13800000002','091512','login',0,'2026-09-07 13:07:00','2026-09-07 13:02:00'),(56,'13800000001','227882','login',0,'2026-09-07 13:07:08','2026-09-07 13:02:08'),(57,'13800000002','240041','login',1,'2026-09-07 13:07:08','2026-09-07 13:02:08'),(58,'13800000002','613293','xxx',0,'2026-09-07 13:07:08','2026-09-07 13:02:08'),(59,'13800000002','433420','login',0,'2026-09-07 13:07:09','2026-09-07 13:02:09'),(60,'13800000001','452502','login',0,'2026-09-07 13:07:34','2026-09-07 13:02:34'),(61,'13800000002','099033','login',1,'2026-09-07 13:07:35','2026-09-07 13:02:35'),(62,'13800000002','111529','xxx',0,'2026-09-07 13:07:35','2026-09-07 13:02:35'),(63,'13800000002','652130','login',0,'2026-09-07 13:07:36','2026-09-07 13:02:36'),(64,'13800000001','986455','login',0,'2026-09-07 13:12:39','2026-09-07 13:07:39'),(65,'13800000002','065569','login',1,'2026-09-07 13:12:40','2026-09-07 13:07:40'),(66,'13800000002','820217','xxx',0,'2026-09-07 13:12:40','2026-09-07 13:07:40'),(67,'13800000002','137522','login',0,'2026-09-07 13:12:41','2026-09-07 13:07:41'),(68,'13800000001','973041','login',0,'2026-09-09 18:42:07','2026-09-09 18:37:07'),(69,'13800000001','646944','login',0,'2026-09-09 20:00:47','2026-09-09 19:55:47'),(70,'13800000001','467713','login',0,'2026-09-09 20:04:12','2026-09-09 19:59:12'),(71,'13800000001','327662','login',0,'2026-09-09 20:04:33','2026-09-09 19:59:33'),(72,'13800000001','498197','login',0,'2026-09-09 20:05:57','2026-09-09 20:00:57'),(73,'13800000002','092880','login',1,'2026-09-09 20:05:57','2026-09-09 20:00:57'),(74,'13800000002','546907','xxx',0,'2026-09-09 20:05:57','2026-09-09 20:00:57'),(75,'13800000002','306691','login',0,'2026-09-09 20:05:58','2026-09-09 20:00:58'),(76,'13800000001','631437','login',0,'2026-09-09 20:07:01','2026-09-09 20:02:01'),(77,'13800000002','048810','login',1,'2026-09-09 20:07:02','2026-09-09 20:02:02'),(78,'13800000002','690151','xxx',0,'2026-09-09 20:07:02','2026-09-09 20:02:02'),(79,'13800000002','402240','login',0,'2026-09-09 20:07:03','2026-09-09 20:02:03'),(80,'13800000001','973504','login',0,'2026-09-09 20:07:15','2026-09-09 20:02:15'),(81,'13800000001','359134','login',0,'2026-09-09 20:07:31','2026-09-09 20:02:31'),(82,'13800000002','981611','login',1,'2026-09-09 20:07:31','2026-09-09 20:02:31'),(83,'13800000002','882797','xxx',0,'2026-09-09 20:07:31','2026-09-09 20:02:31'),(84,'13800000002','584809','login',0,'2026-09-09 20:07:32','2026-09-09 20:02:32'),(85,'13800000001','439916','login',0,'2026-09-09 20:10:10','2026-09-09 20:05:10'),(86,'13800000002','871907','login',1,'2026-09-09 20:10:10','2026-09-09 20:05:10'),(87,'13800000002','364875','xxx',0,'2026-09-09 20:10:10','2026-09-09 20:05:10'),(88,'13800000002','196743','login',0,'2026-09-09 20:10:12','2026-09-09 20:05:12'),(89,'13800000001','782916','login',0,'2026-09-09 22:26:25','2026-09-09 22:21:25'),(90,'13800000002','403838','login',1,'2026-09-09 22:26:27','2026-09-09 22:21:27'),(91,'13800000002','111237','xxx',0,'2026-09-09 22:26:27','2026-09-09 22:21:27'),(92,'13800000002','656172','login',0,'2026-09-09 22:26:29','2026-09-09 22:21:29'),(93,'13800000001','114214','login',0,'2026-09-09 22:42:42','2026-09-09 22:37:42'),(94,'13800000002','611118','login',1,'2026-09-09 22:42:43','2026-09-09 22:37:44'),(95,'13800000002','648272','xxx',0,'2026-09-09 22:42:44','2026-09-09 22:37:44'),(96,'13800000002','590044','login',0,'2026-09-09 22:42:45','2026-09-09 22:37:45'),(97,'13800000001','610405','login',0,'2026-09-09 23:27:12','2026-09-09 23:22:12'),(98,'13800000002','167451','login',1,'2026-09-09 23:27:12','2026-09-09 23:22:12'),(99,'13800000002','741559','xxx',0,'2026-09-09 23:27:12','2026-09-09 23:22:12'),(100,'13800000002','277117','login',0,'2026-09-09 23:27:13','2026-09-09 23:22:13'),(101,'13800000001','996258','login',0,'2026-09-09 23:28:51','2026-09-09 23:23:51'),(102,'13800000002','097759','login',1,'2026-09-09 23:28:51','2026-09-09 23:23:51'),(103,'13800000002','806593','xxx',0,'2026-09-09 23:28:51','2026-09-09 23:23:51'),(104,'13800000002','336641','login',0,'2026-09-09 23:28:52','2026-09-09 23:23:52'),(105,'13800000001','812010','login',0,'2026-09-09 23:30:06','2026-09-09 23:25:06'),(106,'13800000002','869257','login',1,'2026-09-09 23:30:07','2026-09-09 23:25:07'),(107,'13800000002','728309','xxx',0,'2026-09-09 23:30:07','2026-09-09 23:25:07'),(108,'13800000002','061586','login',0,'2026-09-09 23:30:08','2026-09-09 23:25:08'),(109,'13800000001','747800','login',0,'2026-09-10 00:24:34','2026-09-10 00:19:34'),(110,'13800000002','133787','login',1,'2026-09-10 00:24:35','2026-09-10 00:19:35'),(111,'13800000002','456550','xxx',0,'2026-09-10 00:24:35','2026-09-10 00:19:35'),(112,'13800000002','169862','login',0,'2026-09-10 00:24:36','2026-09-10 00:19:36'),(113,'13800000001','959053','login',0,'2026-09-10 00:51:17','2026-09-10 00:46:17'),(114,'13800000002','399451','login',1,'2026-09-10 00:51:18','2026-09-10 00:46:18'),(115,'13800000002','636584','xxx',0,'2026-09-10 00:51:18','2026-09-10 00:46:18'),(116,'13800000002','914253','login',0,'2026-09-10 00:51:19','2026-09-10 00:46:19'),(117,'13800000001','810228','login',0,'2026-09-10 19:22:21','2026-09-10 19:17:21'),(118,'13800000002','499338','login',1,'2026-09-10 19:22:22','2026-09-10 19:17:22'),(119,'13800000002','855832','xxx',0,'2026-09-10 19:22:22','2026-09-10 19:17:22'),(120,'13800000002','001458','login',0,'2026-09-10 19:22:23','2026-09-10 19:17:23'),(121,'13800000001','573588','login',0,'2026-09-10 19:22:32','2026-09-10 19:17:32'),(122,'13800000002','359289','login',1,'2026-09-10 19:22:32','2026-09-10 19:17:32'),(123,'13800000002','009258','xxx',0,'2026-09-10 19:22:32','2026-09-10 19:17:32'),(124,'13800000002','340972','login',1,'2026-09-10 19:22:32','2026-09-10 19:17:32'),(125,'13800000001','571278','login',0,'2026-09-10 19:23:15','2026-09-10 19:18:15'),(126,'13800000002','274807','login',0,'2026-09-10 19:23:15','2026-09-10 19:18:15'),(127,'13800000002','891727','xxx',0,'2026-09-10 19:23:15','2026-09-10 19:18:15'),(128,'13800000002','689935','login',1,'2026-09-10 19:23:15','2026-09-10 19:18:15'),(129,'13800000001','694873','login',0,'2026-09-10 19:23:32','2026-09-10 19:18:32'),(130,'13800000002','277543','login',0,'2026-09-10 19:23:33','2026-09-10 19:18:33'),(131,'13800000002','005423','xxx',0,'2026-09-10 19:23:33','2026-09-10 19:18:33'),(132,'13800000002','830705','login',0,'2026-09-10 19:23:33','2026-09-10 19:18:33'),(133,'13800000001','910480','login',0,'2026-09-10 19:24:04','2026-09-10 19:19:04'),(134,'13800000002','986689','login',1,'2026-09-10 19:24:04','2026-09-10 19:19:04'),(135,'13800000002','398029','xxx',0,'2026-09-10 19:24:04','2026-09-10 19:19:04'),(136,'13800000002','052061','login',0,'2026-09-10 19:24:04','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `sms_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `upload_file`
--

DROP TABLE IF EXISTS `upload_file`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `upload_file` (
  `file_id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL DEFAULT '0',
  `file_name` varchar(200) NOT NULL DEFAULT '',
  `file_path` varchar(255) NOT NULL DEFAULT '',
  `file_url` varchar(255) NOT NULL DEFAULT '',
  `file_size` int NOT NULL DEFAULT '0',
  `mime_type` varchar(50) NOT NULL DEFAULT '',
  `create_time` datetime DEFAULT NULL,
  PRIMARY KEY (`file_id`)
) ENGINE=InnoDB AUTO_INCREMENT=77 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='上传文件';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `upload_file`
--

LOCK TABLES `upload_file` WRITE;
/*!40000 ALTER TABLE `upload_file` DISABLE KEYS */;
INSERT INTO `upload_file` VALUES (1,0,'1.jpg','1788427206319_361622.jpg','http://localhost:3000/uploads/1788427206319_361622.jpg',1001964,'image/jpeg','2026-09-03 17:20:06'),(2,0,'1.jpg','1788427400802_78732.jpg','http://localhost:3000/uploads/1788427400802_78732.jpg',1001964,'image/jpg','2026-09-03 17:23:20'),(3,0,'1.jpg','1788427830447_590045.jpg','http://localhost:3000/uploads/1788427830447_590045.jpg',1001964,'image/jpg','2026-09-03 17:30:30'),(4,0,'1.jpg','1788427866488_66584.jpg','http://localhost:3000/uploads/1788427866488_66584.jpg',1001964,'image/jpg','2026-09-03 17:31:06'),(5,0,'test.jpg','1788756111596_843058.jpg','http://localhost:3000/uploads/1788756111596_843058.jpg',160,'image/jpeg','2026-09-07 12:41:51'),(6,0,'test.jpg','1788756112485_994957.jpg','http://localhost:3000/uploads/1788756112485_994957.jpg',160,'image/jpeg','2026-09-07 12:41:52'),(7,0,'empty.jpg','1788756112652_926909.jpg','http://localhost:3000/uploads/1788756112652_926909.jpg',0,'image/jpeg','2026-09-07 12:41:52'),(8,0,'test.jpg','1788756128485_856087.jpg','http://localhost:3000/uploads/1788756128485_856087.jpg',160,'image/jpeg','2026-09-07 12:42:08'),(9,0,'test.jpg','1788756128966_463062.jpg','http://localhost:3000/uploads/1788756128966_463062.jpg',160,'image/jpeg','2026-09-07 12:42:08'),(10,0,'empty.jpg','1788756129016_776538.jpg','http://localhost:3000/uploads/1788756129016_776538.jpg',0,'image/jpeg','2026-09-07 12:42:09'),(11,0,'test.jpg','1788756557863_773995.jpg','http://localhost:3000/uploads/1788756557863_773995.jpg',160,'image/jpeg','2026-09-07 12:49:17'),(12,0,'test.jpg','1788756558817_641264.jpg','http://localhost:3000/uploads/1788756558817_641264.jpg',160,'image/jpeg','2026-09-07 12:49:18'),(13,0,'empty.jpg','1788756558954_580083.jpg','http://localhost:3000/uploads/1788756558954_580083.jpg',0,'image/jpeg','2026-09-07 12:49:18'),(14,0,'test.jpg','1788756565124_629410.jpg','http://localhost:3000/uploads/1788756565124_629410.jpg',160,'image/jpeg','2026-09-07 12:49:25'),(15,0,'test.jpg','1788756565547_79826.jpg','http://localhost:3000/uploads/1788756565547_79826.jpg',160,'image/jpeg','2026-09-07 12:49:25'),(16,0,'empty.jpg','1788756565613_574768.jpg','http://localhost:3000/uploads/1788756565613_574768.jpg',0,'image/jpeg','2026-09-07 12:49:25'),(17,0,'test.jpg','1788756770902_456407.jpg','http://localhost:3000/uploads/1788756770902_456407.jpg',160,'image/jpeg','2026-09-07 12:52:50'),(18,0,'test.jpg','1788756771842_460160.jpg','http://localhost:3000/uploads/1788756771842_460160.jpg',160,'image/jpeg','2026-09-07 12:52:51'),(19,0,'empty.jpg','1788756771949_38755.jpg','http://localhost:3000/uploads/1788756771949_38755.jpg',0,'image/jpeg','2026-09-07 12:52:51'),(20,0,'test.jpg','1788756779025_231001.jpg','http://localhost:3000/uploads/1788756779025_231001.jpg',160,'image/jpeg','2026-09-07 12:52:59'),(21,0,'test.jpg','1788756779442_883843.jpg','http://localhost:3000/uploads/1788756779442_883843.jpg',160,'image/jpeg','2026-09-07 12:52:59'),(22,0,'empty.jpg','1788756779507_710046.jpg','http://localhost:3000/uploads/1788756779507_710046.jpg',0,'image/jpeg','2026-09-07 12:52:59'),(23,0,'test.jpg','1788756861850_147916.jpg','http://localhost:3000/uploads/1788756861850_147916.jpg',160,'image/jpeg','2026-09-07 12:54:21'),(24,0,'test.jpg','1788756862687_601580.jpg','http://localhost:3000/uploads/1788756862687_601580.jpg',160,'image/jpeg','2026-09-07 12:54:22'),(25,0,'empty.jpg','1788756862792_43467.jpg','http://localhost:3000/uploads/1788756862792_43467.jpg',0,'image/jpeg','2026-09-07 12:54:22'),(26,0,'test.jpg','1788756991287_838169.jpg','http://localhost:3000/uploads/1788756991287_838169.jpg',160,'image/jpeg','2026-09-07 12:56:31'),(27,0,'test.jpg','1788756992350_899405.jpg','http://localhost:3000/uploads/1788756992350_899405.jpg',160,'image/jpeg','2026-09-07 12:56:32'),(28,0,'empty.jpg','1788756992503_235341.jpg','http://localhost:3000/uploads/1788756992503_235341.jpg',0,'image/jpeg','2026-09-07 12:56:32'),(29,0,'test.jpg','1788757089035_321489.jpg','http://localhost:3000/uploads/1788757089035_321489.jpg',160,'image/jpeg','2026-09-07 12:58:09'),(30,0,'test.jpg','1788757090128_876621.jpg','http://localhost:3000/uploads/1788757090128_876621.jpg',160,'image/jpeg','2026-09-07 12:58:10'),(31,0,'empty.jpg','1788757090301_811406.jpg','http://localhost:3000/uploads/1788757090301_811406.jpg',0,'image/jpeg','2026-09-07 12:58:10'),(32,0,'test.jpg','1788757319527_797205.jpg','http://localhost:3000/uploads/1788757319527_797205.jpg',160,'image/jpeg','2026-09-07 13:01:59'),(33,0,'test.jpg','1788757320723_731013.jpg','http://localhost:3000/uploads/1788757320723_731013.jpg',160,'image/jpeg','2026-09-07 13:02:00'),(34,0,'empty.jpg','1788757320896_817708.jpg','http://localhost:3000/uploads/1788757320896_817708.jpg',0,'image/jpeg','2026-09-07 13:02:00'),(35,0,'test.jpg','1788757328530_215764.jpg','http://localhost:3000/uploads/1788757328530_215764.jpg',160,'image/jpeg','2026-09-07 13:02:08'),(36,0,'test.jpg','1788757329534_77902.jpg','http://localhost:3000/uploads/1788757329534_77902.jpg',160,'image/jpeg','2026-09-07 13:02:09'),(37,0,'empty.jpg','1788757329698_525515.jpg','http://localhost:3000/uploads/1788757329698_525515.jpg',0,'image/jpeg','2026-09-07 13:02:09'),(38,0,'test.jpg','1788757355406_655903.jpg','http://localhost:3000/uploads/1788757355406_655903.jpg',160,'image/jpeg','2026-09-07 13:02:35'),(39,0,'test.jpg','1788757356701_211284.jpg','http://localhost:3000/uploads/1788757356701_211284.jpg',160,'image/jpeg','2026-09-07 13:02:36'),(40,0,'empty.jpg','1788757356875_826455.jpg','http://localhost:3000/uploads/1788757356875_826455.jpg',0,'image/jpeg','2026-09-07 13:02:36'),(41,0,'test.jpg','1788757660433_489302.jpg','http://localhost:3000/uploads/1788757660433_489302.jpg',160,'image/jpeg','2026-09-07 13:07:40'),(42,0,'test.jpg','1788757661619_757219.jpg','http://localhost:3000/uploads/1788757661619_757219.jpg',160,'image/jpeg','2026-09-07 13:07:41'),(43,0,'empty.jpg','1788757661789_183309.jpg','http://localhost:3000/uploads/1788757661789_183309.jpg',0,'image/jpeg','2026-09-07 13:07:41'),(44,0,'test.jpg','1788955257683_360903.jpg','http://localhost:3000/uploads/1788955257683_360903.jpg',160,'image/jpeg','2026-09-09 20:00:57'),(45,0,'test.jpg','1788955258793_507405.jpg','http://localhost:3000/uploads/1788955258793_507405.jpg',160,'image/jpeg','2026-09-09 20:00:58'),(46,0,'empty.jpg','1788955258937_609739.jpg','http://localhost:3000/uploads/1788955258937_609739.jpg',0,'image/jpeg','2026-09-09 20:00:58'),(47,0,'test.jpg','1788955322013_395104.jpg','http://localhost:3000/uploads/1788955322013_395104.jpg',160,'image/jpeg','2026-09-09 20:02:02'),(48,0,'test.jpg','1788955323086_582234.jpg','http://localhost:3000/uploads/1788955323086_582234.jpg',160,'image/jpeg','2026-09-09 20:02:03'),(49,0,'empty.jpg','1788955323255_815400.jpg','http://localhost:3000/uploads/1788955323255_815400.jpg',0,'image/jpeg','2026-09-09 20:02:03'),(50,0,'test.jpg','1788955351700_185467.jpg','http://localhost:3000/uploads/1788955351700_185467.jpg',160,'image/jpeg','2026-09-09 20:02:31'),(51,0,'test.jpg','1788955352767_640349.jpg','http://localhost:3000/uploads/1788955352767_640349.jpg',160,'image/jpeg','2026-09-09 20:02:32'),(52,0,'empty.jpg','1788955352934_215922.jpg','http://localhost:3000/uploads/1788955352934_215922.jpg',0,'image/jpeg','2026-09-09 20:02:32'),(53,0,'test.jpg','1788955510771_643541.jpg','http://localhost:3000/uploads/1788955510771_643541.jpg',160,'image/jpeg','2026-09-09 20:05:10'),(54,0,'test.jpg','1788955512061_554685.jpg','http://localhost:3000/uploads/1788955512061_554685.jpg',160,'image/jpeg','2026-09-09 20:05:12'),(55,0,'empty.jpg','1788955512220_708844.jpg','http://localhost:3000/uploads/1788955512220_708844.jpg',0,'image/jpeg','2026-09-09 20:05:12'),(56,0,'test.jpg','1788970775104_334511.jpg','http://localhost:3000/uploads/1788970775104_334511.jpg',160,'image/jpeg','2026-09-10 00:19:35'),(57,0,'test.jpg','1788970776167_179354.jpg','http://localhost:3000/uploads/1788970776167_179354.jpg',160,'image/jpeg','2026-09-10 00:19:36'),(58,0,'empty.jpg','1788970776336_758151.jpg','http://localhost:3000/uploads/1788970776336_758151.jpg',0,'image/jpeg','2026-09-10 00:19:36'),(59,0,'test.jpg','1788972378069_986741.jpg','http://localhost:3000/uploads/1788972378069_986741.jpg',160,'image/jpeg','2026-09-10 00:46:18'),(60,0,'test.jpg','1788972379167_950970.jpg','http://localhost:3000/uploads/1788972379167_950970.jpg',160,'image/jpeg','2026-09-10 00:46:19'),(61,0,'empty.jpg','1788972379320_700288.jpg','http://localhost:3000/uploads/1788972379320_700288.jpg',0,'image/jpeg','2026-09-10 00:46:19'),(62,0,'test.jpg','1789039042048_602988.jpg','http://localhost:3000/uploads/1789039042048_602988.jpg',160,'image/jpeg','2026-09-10 19:17:22'),(63,0,'test.jpg','1789039043075_387997.jpg','http://localhost:3000/uploads/1789039043075_387997.jpg',160,'image/jpeg','2026-09-10 19:17:23'),(64,0,'empty.jpg','1789039043249_772350.jpg','http://localhost:3000/uploads/1789039043249_772350.jpg',0,'image/jpeg','2026-09-10 19:17:23'),(65,0,'test.jpg','1789039052627_667149.jpg','http://localhost:3000/uploads/1789039052627_667149.jpg',160,'image/jpeg','2026-09-10 19:17:32'),(66,0,'test.jpg','1789039052866_819301.jpg','http://localhost:3000/uploads/1789039052866_819301.jpg',160,'image/jpeg','2026-09-10 19:17:32'),(67,0,'empty.jpg','1789039052896_513993.jpg','http://localhost:3000/uploads/1789039052896_513993.jpg',0,'image/jpeg','2026-09-10 19:17:32'),(68,0,'test.jpg','1789039095566_200539.jpg','http://localhost:3000/uploads/1789039095566_200539.jpg',160,'image/jpeg','2026-09-10 19:18:15'),(69,0,'test.jpg','1789039095755_662509.jpg','http://localhost:3000/uploads/1789039095755_662509.jpg',160,'image/jpeg','2026-09-10 19:18:15'),(70,0,'empty.jpg','1789039095764_278325.jpg','http://localhost:3000/uploads/1789039095764_278325.jpg',0,'image/jpeg','2026-09-10 19:18:15'),(71,0,'test.jpg','1789039113107_280070.jpg','http://localhost:3000/uploads/1789039113107_280070.jpg',160,'image/jpeg','2026-09-10 19:18:33'),(72,0,'test.jpg','1789039113321_121274.jpg','http://localhost:3000/uploads/1789039113321_121274.jpg',160,'image/jpeg','2026-09-10 19:18:33'),(73,0,'empty.jpg','1789039113356_638042.jpg','http://localhost:3000/uploads/1789039113356_638042.jpg',0,'image/jpeg','2026-09-10 19:18:33'),(74,0,'test.jpg','1789039144494_516398.jpg','http://localhost:3000/uploads/1789039144494_516398.jpg',160,'image/jpeg','2026-09-10 19:19:04'),(75,0,'test.jpg','1789039144728_203431.jpg','http://localhost:3000/uploads/1789039144728_203431.jpg',160,'image/jpeg','2026-09-10 19:19:04'),(76,0,'empty.jpg','1789039144764_72941.jpg','http://localhost:3000/uploads/1789039144764_72941.jpg',0,'image/jpeg','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `upload_file` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `user_id` int unsigned NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `mobile` varchar(11) NOT NULL DEFAULT '' COMMENT '手机号',
  `password` varchar(100) NOT NULL DEFAULT '' COMMENT '登录密码(bcrypt)',
  `nickname` varchar(50) NOT NULL DEFAULT '' COMMENT '昵称',
  `avatar_url` varchar(255) NOT NULL DEFAULT '' COMMENT '头像',
  `gender` tinyint NOT NULL DEFAULT '0' COMMENT '性别 0未知 1男 2女',
  `balance` decimal(10,2) NOT NULL DEFAULT '0.00' COMMENT '余额',
  `points` int NOT NULL DEFAULT '0' COMMENT '积分',
  `pay_password` varchar(100) NOT NULL DEFAULT '' COMMENT '支付密码',
  `status` tinyint NOT NULL DEFAULT '1' COMMENT '状态 1正常 0禁用',
  `register_time` datetime DEFAULT NULL COMMENT '注册时间',
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  `is_delete` tinyint NOT NULL DEFAULT '0',
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `uk_mobile` (`mobile`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'13800000022','$2a$08$LCjjBXpVsZS/gUcqVYf1u.XjxaHTWzszgTo1F2MV.j7JtXHdTWyyy','张三','https://picsum.photos/seed/avatar13800000001/100/100',1,268.50,1280,'',1,'2026-09-03 16:15:44','2026-09-03 16:15:44','2026-09-05 13:23:41',0),(2,'13800000002','$2a$08$LCjjBXpVsZS/gUcqVYf1u.XjxaHTWzszgTo1F2MV.j7JtXHdTWyyy','张三','https://picsum.photos/seed/avatar13800000002/100/100',1,3038.00,482584,'',1,'2026-09-03 16:15:44','2026-09-03 16:15:44','2026-09-10 19:19:04',0),(3,'13800000003','$2a$08$LCjjBXpVsZS/gUcqVYf1u.XjxaHTWzszgTo1F2MV.j7JtXHdTWyyy','测试用户小刚','https://picsum.photos/seed/avatar13800000003/100/100',1,0.00,50,'',1,'2026-09-03 16:15:44','2026-09-03 16:15:44','2026-09-03 16:15:44',0);
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_address`
--

DROP TABLE IF EXISTS `user_address`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_address` (
  `address_id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL COMMENT '用户ID',
  `name` varchar(30) NOT NULL DEFAULT '' COMMENT '收货人',
  `phone` varchar(20) NOT NULL DEFAULT '' COMMENT '联系电话',
  `province` varchar(30) NOT NULL DEFAULT '' COMMENT '省',
  `city` varchar(30) NOT NULL DEFAULT '' COMMENT '市',
  `district` varchar(30) NOT NULL DEFAULT '' COMMENT '区',
  `detail` varchar(200) NOT NULL DEFAULT '' COMMENT '详细地址',
  `is_default` tinyint NOT NULL DEFAULT '0' COMMENT '是否默认 1是 0否',
  `create_time` datetime DEFAULT NULL,
  `update_time` datetime DEFAULT NULL,
  PRIMARY KEY (`address_id`),
  KEY `idx_user` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=122 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='收货地址';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_address`
--

LOCK TABLES `user_address` WRITE;
/*!40000 ALTER TABLE `user_address` DISABLE KEYS */;
INSERT INTO `user_address` VALUES (1,1,'张三','13800000001','陕西省','西安市','雁塔区','高新路 88 号万象汇 1 栋 1101 室',0,'2026-09-03 16:15:44','2026-09-03 16:15:44'),(2,1,'张三(公司)','13800000001','陕西省','西安市','碑林区','南关正街 99 号中贸广场 15 层',0,'2026-09-03 16:15:44','2026-09-03 16:15:44'),(3,2,'张三改','13800000001','陕西省','西安市','雁塔区','更新地址',1,'2026-09-03 16:15:44','2026-09-10 19:19:04'),(4,3,'王五','13800000003','浙江省','杭州市','西湖区','文三路 478 号华星时代广场',1,'2026-09-03 16:15:44','2026-09-03 16:15:44'),(5,1,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-05 13:23:41','2026-09-05 13:23:41'),(6,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-06 00:24:21','2026-09-06 00:24:21'),(7,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:27:43','2026-09-07 12:27:43'),(8,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:29:38','2026-09-07 12:29:38'),(9,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(10,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(11,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:29:39','2026-09-07 12:29:39'),(12,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:35:02','2026-09-07 12:35:02'),(13,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(14,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(15,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:35:03','2026-09-07 12:35:03'),(16,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:35:13','2026-09-07 12:35:13'),(17,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:35:32','2026-09-07 12:35:32'),(18,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:41:51','2026-09-07 12:41:51'),(19,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:41:51','2026-09-07 12:41:51'),(20,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:41:51','2026-09-07 12:41:51'),(21,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(22,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(23,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:42:08','2026-09-07 12:42:08'),(24,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:49:17','2026-09-07 12:49:17'),(25,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(26,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(27,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:49:18','2026-09-07 12:49:18'),(28,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:49:24','2026-09-07 12:49:24'),(29,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(30,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(31,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:49:25','2026-09-07 12:49:25'),(32,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:52:50','2026-09-07 12:52:50'),(33,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(34,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(35,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:52:51','2026-09-07 12:52:51'),(36,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:52:58','2026-09-07 12:52:58'),(37,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(38,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(39,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:52:59','2026-09-07 12:52:59'),(40,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:54:21','2026-09-07 12:54:21'),(41,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(42,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(43,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:54:22','2026-09-07 12:54:22'),(44,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:56:30','2026-09-07 12:56:30'),(45,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(46,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(47,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:56:31','2026-09-07 12:56:31'),(48,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 12:58:08','2026-09-07 12:58:08'),(49,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 12:58:09','2026-09-07 12:58:09'),(50,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 12:58:09','2026-09-07 12:58:09'),(51,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 12:58:09','2026-09-07 12:58:09'),(52,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 13:01:59','2026-09-07 13:01:59'),(53,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 13:01:59','2026-09-07 13:01:59'),(54,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 13:01:59','2026-09-07 13:01:59'),(55,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 13:01:59','2026-09-07 13:01:59'),(56,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(57,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(58,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(59,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 13:02:08','2026-09-07 13:02:08'),(60,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 13:02:34','2026-09-07 13:02:34'),(61,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(62,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(63,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 13:02:35','2026-09-07 13:02:35'),(64,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-07 13:07:39','2026-09-07 13:07:39'),(65,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(66,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(67,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-07 13:07:40','2026-09-07 13:07:40'),(68,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 20:00:57','2026-09-09 20:00:57'),(69,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 20:00:57','2026-09-09 20:00:57'),(70,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 20:00:57','2026-09-09 20:00:57'),(71,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 20:00:58','2026-09-09 20:00:58'),(72,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 20:02:01','2026-09-09 20:02:01'),(73,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 20:02:02','2026-09-09 20:02:02'),(74,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 20:02:02','2026-09-09 20:02:02'),(75,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 20:02:02','2026-09-09 20:02:02'),(76,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 20:02:15','2026-09-09 20:02:15'),(77,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 20:02:31','2026-09-09 20:02:31'),(78,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 20:02:31','2026-09-09 20:02:31'),(79,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 20:02:31','2026-09-09 20:02:31'),(80,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 20:02:32','2026-09-09 20:02:32'),(81,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 20:05:10','2026-09-09 20:05:10'),(82,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(83,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(84,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 20:05:11','2026-09-09 20:05:11'),(85,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 22:21:26','2026-09-09 22:21:26'),(86,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 22:21:27','2026-09-09 22:21:27'),(87,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 22:21:27','2026-09-09 22:21:27'),(88,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 22:21:27','2026-09-09 22:21:27'),(89,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 22:37:42','2026-09-09 22:37:42'),(90,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 22:37:44','2026-09-09 22:37:44'),(91,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 22:37:44','2026-09-09 22:37:44'),(92,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 22:37:44','2026-09-09 22:37:44'),(93,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 23:22:12','2026-09-09 23:22:12'),(94,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 23:22:12','2026-09-09 23:22:12'),(95,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 23:22:12','2026-09-09 23:22:12'),(96,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 23:22:13','2026-09-09 23:22:13'),(97,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 23:23:51','2026-09-09 23:23:51'),(98,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(99,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(100,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 23:23:52','2026-09-09 23:23:52'),(101,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-09 23:25:06','2026-09-09 23:25:06'),(102,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-09 23:25:07','2026-09-09 23:25:07'),(103,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-09 23:25:07','2026-09-09 23:25:07'),(104,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-09 23:25:07','2026-09-09 23:25:07'),(105,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 00:19:34','2026-09-10 00:19:34'),(106,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(107,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(108,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-10 00:19:35','2026-09-10 00:19:35'),(109,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 00:46:17','2026-09-10 00:46:17'),(110,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(111,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(112,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-10 00:46:18','2026-09-10 00:46:18'),(113,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 19:17:21','2026-09-10 19:17:21'),(114,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(115,2,'自动化','13800000001','陕西省','西安市','雁塔区','自动化测试地址',0,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(116,2,'默认测试','13800000001','陕西省','西安市','雁塔区','默认地址测试',0,'2026-09-10 19:17:22','2026-09-10 19:17:22'),(117,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 19:17:32','2026-09-10 19:17:32'),(118,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(119,2,'超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名超长姓名1','13800000001','','','','x',0,'2026-09-10 19:18:15','2026-09-10 19:18:15'),(120,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 19:18:32','2026-09-10 19:18:32'),(121,2,'张三','13800000001','陕西省','西安市','雁塔区','高新路88号',0,'2026-09-10 19:19:04','2026-09-10 19:19:04');
/*!40000 ALTER TABLE `user_address` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_coupon`
--

DROP TABLE IF EXISTS `user_coupon`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_coupon` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int NOT NULL,
  `coupon_id` int NOT NULL,
  `name` varchar(50) NOT NULL DEFAULT '',
  `type` tinyint NOT NULL DEFAULT '10',
  `reduce_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `min_price` decimal(10,2) NOT NULL DEFAULT '0.00',
  `discount` decimal(3,2) NOT NULL DEFAULT '1.00',
  `status` tinyint NOT NULL DEFAULT '0' COMMENT '0未使用 1已使用 2已过期',
  `order_id` int NOT NULL DEFAULT '0',
  `receive_time` datetime DEFAULT NULL,
  `expire_time` datetime DEFAULT NULL,
  `use_time` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `idx_user_status` (`user_id`,`status`)
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='用户优惠券';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_coupon`
--

LOCK TABLES `user_coupon` WRITE;
/*!40000 ALTER TABLE `user_coupon` DISABLE KEYS */;
INSERT INTO `user_coupon` VALUES (1,1,2,'满300减50通用券',10,50.00,300.00,1.00,0,0,'2026-09-03 16:15:46','2026-10-03 16:15:46',NULL),(2,1,1,'新人满100减20优惠券',10,20.00,100.00,1.00,1,999,'2026-09-03 16:15:46','2026-10-03 16:15:46','2026-09-03 16:15:46'),(46,2,1,'新人满100减20优惠券',10,20.00,100.00,1.00,0,0,'2026-09-10 19:19:04','2026-10-10 19:19:04',NULL);
/*!40000 ALTER TABLE `user_coupon` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-09-10 22:42:05
